*
*
*            ********************************************
*            *                                          *
*            *      ####   #   #####   ####   #         *
*            *      #      #   #   #   #      #         *
*            *      ####   #   #####   #      #         *
*            *         #   #   #   #   #      #         *
*            *      ####   #   #   #   ####   #         *
*            *                                          *
*            *  SISTEMA INTEGRADO DE ADMINISTRACAO DA   *
*            *                                          *
*            *         CARTEIRA IMOBILIARIA             *
*            *                                          *
*            *                                          *
*            *         MODULO DE PAGAMENTOS             *
*            *                                          *
*            *                                          *
*            *         CMC - CONSULTA MIGRACAO          *
*            *                  DE CONTAS               *
*            *                                          *
*            *           DATAMEC S/A   -  BHZ           *
*            *                                          *
*            ********************************************
*TH ESTE PROGRAMA FOI COPIADO A PARTIR DO PROGRAMA 215 CPG
/
$SET LIST LINEINFO ERRORLIST FREE FEDLEVEL = 5 INTEGERBNRY
$SET LEVEL = 3 BINDINFO
*$TADS
$SET BINDINFO
*
 IDENTIFICATION DIVISION.
*
 PROGRAM-ID.     S0347-FTE-445.
*
 ENVIRONMENT DIVISION.
*
******************************************************************
*  ESTE PROGRAMA DEVE SER COMPILADO COM O COMPILADOR BDMSCOBOL85 *
*  E COM A OPCAO $FEDLEVEL = 5 (COBOL74 COM EXTENSAO BURROUGHS). *
******************************************************************
*
 CONFIGURATION SECTION.
 SOURCE-COMPUTER. A15.
 OBJECT-COMPUTER. A15.
 SPECIAL-NAMES.
          DICTIONARY IS "SCREENDESIGN",
          PROGRAM-NAME IS "PRG-CONSULTA-PAG".
*
 DATA DIVISION.
*
 DATA-BASE SECTION.
 DB BDCADASTRO   OF BDSIACI COMMON ALL.
 DB BDPARAMETROS OF BDSIACIPAR COMMON ALL.
 DB BDSIACISEC              COMMON ALL.
*
 WORKING-STORAGE SECTION.
*
 01 NUMERO-PAGINA-WS    REAL.
 01 COLUNA-INICIAL-WS   REAL.
 01 LINHA-INICIAL-WS    REAL.
 01 TAMANHO-TELA-WS     REAL.

 77  SEND-PAGINADOR-77            PIC 9(01) COMMON.

 77  AGENDA-DESTINO-77            REAL COMMON.
 77  AGENDA-INPUT-77              REAL COMMON.
 77  PROGRAMA-DESIGNATOR-77       REAL COMMON.
 77  RESULTADO-77                 PIC S9(11) BINARY EXTENDED.
 77  CONSISTE-77                  PIC 9.
 77  IND-SEQ                      PIC 99.
 77  IND                          PIC 99.
 77  IND-77                       PIC 99.
 77  IND-POS                      PIC 99 VALUE ZEROS.
 77  CH-ACHOU-PAGTO               PIC X  VALUE SPACES.
 77  PRIMEIRA-VEZ                 PIC 9  VALUE ZEROS.
 77  SCN-COD-TABELA-WS            PIC X(03).
 77  SCN-CHAVE-TAB-WS             PIC X(30) VALUE SPACES.
 77  SCN-CHAVE-TAB-WS-DOM         PIC X(03) VALUE SPACES.
 77  SCN-CHAVE-TAB-WS-1           PIC X(30) VALUE SPACES.
 77  SCN-CHAVE-TAB-WS-1-DOM       PIC X(03) VALUE SPACES.

* VARIAVEIS 77 NOVAS
 77  WINDOW-DESIGNATOR-77        REAL.
 77  ESTACAO-REAL-77             REAL.
 77  STATION-DESIG-77            PIC S9(11)  BINARY.
 77  STATION-DEVICE-77           PIC S9(11)  BINARY.
 77  STATION-LSN-77              PIC S9(11)  BINARY.
 77  STATION-SEC-77              PIC S9(11)  BINARY.
 77  IND-SEC-GLOBAL-77           PIC 9(02).
 77  CODIGO-INFORMACAO-77        PIC S9(11) BINARY EXTENDED.
 77  ENVIA-TELA-77               PIC S9(11)  BINARY EXTENDED.

 01 CON-IDENT-REL                PIC 9(12).
 01 UNO-SIDEC-AUX-REL            PIC 9(05).
 01 CTA-SIDEC-AUX-REL            PIC 9(12).
 01 CTA-NSGD-AUX-REL             PIC 9(12).

*
*----------------------------------------------------------------*
* VALORES ASSUMIDOS PELOS CAMPOS DO HEADER E USADOS NO PROGRAMA  *
*----------------------------------------------------------------*

 01 VALORES-STATUSVALUE-IN USAGE BINARY.
    03 FINALIZAR                    PIC S9(11) BINARY VALUE 99.

 01 VALORES-STATUSVALUE-OUT       USAGE BINARY EXTENDED.
*
     03 SEND-SEM-ERRO             PIC S9(11) BINARY EXTENDED VALUE
     00                                                     .
     03 RECUPERACAO-SINCRONIZADA  PIC S9(11) BINARY EXTENDED VALUE
     92                                                     .
     03 DESTINO-INVALIDO          PIC S9(11) BINARY EXTENDED VALUE
     94                                                     .
     03 DESIGNATOR-AG-INVALIDO    PIC S9(11) BINARY EXTENDED VALUE
     95                                                     .
     03 MSG-PARADA-ITEM-PROC      PIC S9(11) BINARY EXTENDED VALUE
     96                                                     .
     03 DESTINO-DESABILITADO      PIC S9(11) BINARY EXTENDED VALUE
     97                                                     .
     03 IP-NDISP-OU-ERRO-SEG      PIC S9(11) BINARY EXTENDED VALUE
     98                                                     .
*
***
* AREA DE INPUT HEADER PARA PASSAGEM DE PARAMETROS
***
*
 01 ARRAY-IN-WS USAGE             REAL COMMON.
*
    03 PROGRAMDESG-WS             REAL.
    03 FUNCTIONINDEX-WS           REAL.
    03 USERCODE-WS                REAL.
    03 SECURITYDESG-WS            REAL.
    03 FIELDS-WS                  REAL.
    03 TIMESTAMP-WS               REAL.
    03 STATION-WS                 REAL.
    03 TEXTLENGTH-WS              REAL.
    03 FILLER-WS                  REAL.
    03 STATUSVALUE-WS             REAL.
    03 RESTART-WS                 REAL.
    03 AGENDA-WS                  REAL.
    03 SDFINFO-WS                 REAL.
    03 FORM-KEY-WS                REAL.
    03 SDFTRANSNUM                REAL.
    03 SDFFORMRECNUM-WS           REAL.

 01 SV-CONSULTAS-CMC COMMON.
    COPY "S0347/LIB/SRV/V034744501".
*
 01 SV-AREA-ESTACAO COMMON.
    COPY "(PROJETO)S0347/LIB/02/AREA/ESTACAO ON PROJETO01".
*
 01 SV-AREA-ACESSO.
    COPY "(PROJETO)S0347/LIB/124/ACESSO      ON PROJETO01".
/
 COMMUNICATION SECTION.
*
 INPUT HEADER COMS-IN
     CONVERSATION AREA.
     02 CONVERSATION-AREA         REAL.
         03 FORM-KEY-IN           REAL.
 OUTPUT HEADER COMS-OUT
     CONVERSATION AREA.
     02 CONVERSATION-AREA         REAL.
         03 FORM-KEY-OUT          REAL.
         03 PAGINADOR-OUT         REAL.
/
 LOCAL-STORAGE SECTION.

  COPY "(PROJETO)S0347/LIB/00/LIB101/PARAMETROS ON PROJETO01".

  COPY "(PROJETO)S0997/LIB/00/INST/PARAMETROS ON PROJETO01".

 PROGRAM-LIBRARY SECTION.

  COPY "(PROJETO)S0347/LIB/00/LIB101/ENTRYPOINTS ON PROJETO01".

$SET LIBINST_TRATA_ERRO_SAIDA

 COPY "(PROJETO)S0997/LIB/00/INST/ENTRYPOINTS ON PROJETO01".
*
 PROCEDURE DIVISION.
*
 CORPO-PROG SECTION.
*
 001-INI-PROGRAMA.
*
*---
* Inicializar areas declaradas como "OWN".
* Areas declaradas assim melhoram a performance do programa
* evitando que ele faca novamente o processo de alocacao.
* Toda nova variavel devera ser reinicializa, pois seu valor sera
* mantido na memoria numa proxima chamada do programa.
* Campos "FILLER" sao ignorados pelo comando "INITIALIZE",
* permanecendo com o valor descrito na clausula "VALUE".
* JAN/2001.
*---

     INITIALIZE RESULTADO-77            CONSISTE-77
                IND-SEQ                 IND
                IND-77                  IND-POS.

 010-INICIO-CONSULTAS-CMC.

     MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC.

     PERFORM 020-ACAO THRU 020-FIM-ACAO.

     GO TO FIM-PROGRAMA.

 010-FIM-CONSULTAS-CMC.
   EXIT.

 020-ACAO.
     MOVE ZEROS TO CONT-REG OF SV-CONSULTAS-CMC.

     IF ACAO OF SV-CONSULTAS-CMC = "CON" OR "LIM" OR "REL"
        CONTINUE
     ELSE
        MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
        MOVE "ACAO INVALIDA." TO MENSAGEM-RESULTADO
                                   OF SV-CONSULTAS-CMC
        GO TO 020-FIM-ACAO.

     IF ACAO OF SV-CONSULTAS-CMC  = "CON" OR "REL"
*       GO TO 050-BUSCAR-CONTAS.
        PERFORM 050-BUSCAR-CONTAS THRU 050-FIM-CONSULTA.

     IF ACAO OF SV-CONSULTAS-CMC = "LIM"
*       GO TO 090-LIMPA.
        PERFORM 090-LIMPA THRU 090-FIM-LIMPA.

*     IF ACAO OF SV-CONSULTAS-CMC = "REL"
*        PERFORM 0300-RELATORIO THRU 0300-FIM-RELATORIO.

 020-FIM-ACAO.
   EXIT.

 050-BUSCAR-CONTAS.

* PADRAO-CONTA = 0 BUSCAR CONTA NSGD POR CONTA SIDEC
     IF PADRAO-CONTA OF SV-CONSULTAS-CMC = 0 OR 1 OR 2 OR 3
        CONTINUE
     ELSE
        MOVE "PADRAO CONTA INVALIDO."
        TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
        GO TO 050-FIM-CONSULTA.

     IF PADRAO-CONTA OF SV-CONSULTAS-CMC = 0
        IF UNO-SIDEC-ENTRADA OF SV-CONSULTAS-CMC = ZEROS
           MOVE "FAVOR INFORMAR UMA AGENCIA SIDEC."
           TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
           MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
           MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
        END-IF

        IF CTA-SIDEC-ENTRADA OF SV-CONSULTAS-CMC = ZEROS
           MOVE "FAVOR INFORMAR UMA CONTA CORRENTE SIDEC."
           TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
           MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
           MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
        END-IF

        IF CTA-SIDEC-ENTRADA OF SV-CONSULTAS-CMC = ZEROS AND
           UNO-SIDEC-ENTRADA OF SV-CONSULTAS-CMC = ZEROS
           MOVE "FAVOR INFORMAR UMA CONTA E UMA AGENCIA SIDEC."
           TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
           MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
           MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
        END-IF

        IF CODIGO-RESULTADO OF SV-CONSULTAS-CMC = 1
           GO TO 050-FIM-CONSULTA
        END-IF

        PERFORM 100-BUSCAR-SIDEC-NSGD
           THRU 100-FIM-BUSCAR-SIDEC-NSGD

     END-IF.

* PADRAO-CONTA = 1 BUSCAR CONTA SIDEC POR CONTA NSGD

     IF PADRAO-CONTA OF SV-CONSULTAS-CMC = 1
        IF CTA-NSGD-ENTRADA OF SV-CONSULTAS-CMC = ZEROS
           MOVE "FAVOR INFORMAR A CONTA CORRENTE NSGD."
           TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
           MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
           MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
        END-IF

        IF PRD-NSGD-ENTRADA OF SV-CONSULTAS-CMC = ZEROS
           MOVE "FAVOR INFORMAR O PRODUTO NSGD."
           TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
           MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
           MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
        END-IF

        IF PRD-NSGD-ENTRADA OF SV-CONSULTAS-CMC = ZEROS AND
           CTA-NSGD-ENTRADA OF SV-CONSULTAS-CMC = ZEROS
           MOVE "FAVOR INFORMAR O PRODUTO E A CONTA NSGD."
           TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
           MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
           MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
        END-IF

        IF CODIGO-RESULTADO OF SV-CONSULTAS-CMC = 1
           GO TO 050-FIM-CONSULTA
        END-IF

        PERFORM 100-BUSCAR-NSGD-SIDEC
           THRU 100-FIM-BUSCAR-NSGD-SIDEC

     END-IF.

* PADRAO-CONTA = 2 BUSCAR CONTA POR CONTRATO
     IF PADRAO-CONTA OF SV-CONSULTAS-CMC = 2
        IF CON-IDENTIFICACAO OF SV-CONSULTAS-CMC = ZEROS
           MOVE "FAVOR INFORMAR UM CONTRATO VIGENTE."
           TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
*D550134 - ALTERACAO INFO VAZIA
           MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
           MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
           GO TO 050-FIM-CONSULTA
        END-IF

        PERFORM 100-BUSCAR-NSGD-SIDEC-CONTRATO
           THRU 100-FIM-BUSCAR-NSGD-SIDEC-CTR

     END-IF.

 050-FIM-CONSULTA.
   EXIT.

 090-LIMPA.
*
*     MOVE "CON"  TO ACAO     OF SV-CONSULTAS-CMC.
     MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC.
     MOVE 3 TO PADRAO-CONTA OF SV-CONSULTAS-CMC.
     MOVE "V034744501" TO TRANCODE OF SV-CONSULTAS-CMC
                          TRANCODE OF SV-AREA-ESTACAO
                          TRANCODE-VOL OF SV-AREA-ESTACAO.
     MOVE ZEROS  TO CONT-REG
                              OF SV-CONSULTAS-CMC
                    SCN-UNO-SIDEC
                              OF SV-CONSULTAS-CMC(1)
                    SCN-CONTA-SIDEC
                              OF SV-CONSULTAS-CMC(1)
                    SCN-UNO-NSGD
                              OF SV-CONSULTAS-CMC(1)
                    SCN-CONTA-NSGD
                              OF SV-CONSULTAS-CMC(1)
                    SCN-DIGITO-NSGD
                              OF SV-CONSULTAS-CMC(1)
                    CTR-ENTRADA
                              OF SV-CONSULTAS-CMC(1).
*                    CONTA-LINHAS-WK.
*  INITIALIZE SV-CONSULTAS-CMC.

 090-FIM-LIMPA.
     EXIT.

 100-BUSCAR-SIDEC-NSGD.
    MOVE "N" TO FLAG-FIM OF SV-CONSULTAS-CMC.
*    MOVE 1 TO CONT-REG OF SV-CONSULTAS-CMC.

    FIND FIRST SCN-POR-CTA-SIDEC
      AT SCN-UNO-SIDEC =
         UNO-SIDEC-ENTRADA OF SV-CONSULTAS-CMC
     AND SCN-CONTA-SIDEC =
         CTA-SIDEC-ENTRADA OF SV-CONSULTAS-CMC
      ON EXCEPTION
         IF DMSTATUS(NOTFOUND)
            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
            MOVE "NAO HA CONTA NSGD CORRESPONDENTE A CONTA SIDEC I
-                "NFORMADA." TO MENSAGEM-RESULTADO
                               OF SV-CONSULTAS-CMC
            GO TO 100-FIM-BUSCAR-SIDEC-NSGD
         ELSE
            CALL SYSTEM DMTERMINATE.

    IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
         MOVE 1 TO CONT-REG OF SV-CONSULTAS-CMC
         MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
         PERFORM 0200-MONTA-DETALHE THRU 0200-FIM-MONTA-DETALHE
    ELSE
         MOVE "NAO HA CONTA NSGD CORRESPONDENTE A CONTA SIDEC INFO
-             "RMADA." TO MENSAGEM-RESULTADO.

 NEXT-SIDEC-NSGD.

    IF ACAO OF SV-CONSULTAS-CMC = "CON"
      IF CONT-REG OF SV-CONSULTAS-CMC > 50
         MOVE "LIMITE DA TELA EXCEDIDO, PARA VISUALIZAR TODOS OS R
-        "EGISTROS EMITA O RELATORIO" TO MENSAGEM-RESULTADO
         OF SV-CONSULTAS-CMC
         GO TO 100-FIM-BUSCAR-SIDEC-NSGD
      END-IF
    END-IF

    IF ACAO OF SV-CONSULTAS-CMC  = "REL"
      IF CONT-REG OF SV-CONSULTAS-CMC > 300 AND
         FLAG-FIM OF SV-CONSULTAS-CMC = "N"
            MOVE 0 TO CONT-REG OF SV-CONSULTAS-CMC
            MOVE UNO-SIDEC-ENTRADA OF SV-CONSULTAS-CMC
               TO UNO-SIDEC-AUX-REL
            MOVE CTA-SIDEC-ENTRADA OF SV-CONSULTAS-CMC
               TO CTA-SIDEC-AUX-REL
            GO TO NEXT-SIDEC-NSGD-REL
       END-IF
    END-IF

    FIND NEXT SCN-POR-CTA-SIDEC
      AT SCN-UNO-SIDEC =
         UNO-SIDEC-ENTRADA OF SV-CONSULTAS-CMC
     AND SCN-CONTA-SIDEC =
         CTA-SIDEC-ENTRADA OF SV-CONSULTAS-CMC
      ON EXCEPTION
         IF DMSTATUS(NOTFOUND)
            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
            GO TO 100-FIM-BUSCAR-SIDEC-NSGD
         ELSE
            CALL SYSTEM DMTERMINATE.

    IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
         ADD 1 TO CONT-REG OF SV-CONSULTAS-CMC
         MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
         PERFORM 0200-MONTA-DETALHE THRU 0200-FIM-MONTA-DETALHE.

    GO TO NEXT-SIDEC-NSGD.

 NEXT-SIDEC-NSGD-REL.

    FIND NEXT SCN-POR-CTA-SIDEC
      AT SCN-UNO-SIDEC =
         UNO-SIDEC-AUX-REL
     AND SCN-CONTA-SIDEC =
         CTA-SIDEC-AUX-REL
      ON EXCEPTION
         IF DMSTATUS(NOTFOUND)
            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
            GO TO 100-FIM-BUSCAR-SIDEC-NSGD
         ELSE
            CALL SYSTEM DMTERMINATE.

     IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
         ADD 1 TO CONT-REG OF SV-CONSULTAS-CMC
         MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
         PERFORM 0200-MONTA-DETALHE THRU 0200-FIM-MONTA-DETALHE.

    GO TO NEXT-SIDEC-NSGD-REL.

 100-FIM-BUSCAR-SIDEC-NSGD.
 EXIT.
*-----------------------------------------------------------------

 100-BUSCAR-NSGD-SIDEC.

    MOVE "N" TO FLAG-FIM OF SV-CONSULTAS-CMC.
*    MOVE 1 TO CONT-REG OF SV-CONSULTAS-CMC.

    FIND FIRST SCN-POR-CTA-NSGD
      AT SCN-CONTA-NSGD =
         CTA-NSGD-ENTRADA OF SV-CONSULTAS-CMC AND
         SCN-PRD-NSGD =
         PRD-NSGD-ENTRADA OF SV-CONSULTAS-CMC
      ON EXCEPTION
         IF DMSTATUS(NOTFOUND)
            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
            MOVE "NAO HA CONTA SIDEC CORRESPONDENTE A CONTA NSGD I
-                "NFORMADA."
              TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
            MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
*D550134 - BG248038
            MOVE ZEROS TO SCN-UNO-SIDEC
*                           OF SV-CONSULTAS-CMC(CONT-REG)
                          OF SV-CONSULTAS-CMC(1)
                          SCN-CONTA-SIDEC
*                           OF SV-CONSULTAS-CMC(CONT-REG)
                          OF SV-CONSULTAS-CMC(1)
*D550134 - BG248038
            GO TO 100-FIM-BUSCAR-NSGD-SIDEC
         ELSE
            CALL SYSTEM DMTERMINATE.

    IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
         MOVE 1 TO CONT-REG OF SV-CONSULTAS-CMC
         MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
         PERFORM 0200-MONTA-DETALHE THRU 0200-FIM-MONTA-DETALHE
    ELSE
       MOVE "NAO HA CONTA SIDEC CORRESPONDENTE A CONTA NSGD INFORM
-           "ADA." TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC.

*    MOVE ZEROS TO SCN-UNO-SIDEC   OF SV-CONSULTAS-CMC
*                  SCN-CONTA-SIDEC OF SV-CONSULTAS-CMC.

  NEXT-NSGD-SIDEC.
    IF ACAO OF SV-CONSULTAS-CMC = "CON"
      IF CONT-REG OF SV-CONSULTAS-CMC > 50
         MOVE "LIMITE DA TELA EXCEDIDO, PARA VISUALIZAR TODOS OS R
-        "EGISTROS EMITA O RELATORIO" TO MENSAGEM-RESULTADO
         OF SV-CONSULTAS-CMC
         GO TO  100-FIM-BUSCAR-NSGD-SIDEC
      END-IF
    END-IF

    IF ACAO OF SV-CONSULTAS-CMC  = "REL"
      IF CONT-REG OF SV-CONSULTAS-CMC > 300 AND
         FLAG-FIM OF SV-CONSULTAS-CMC = "N"
            MOVE 0 TO CONT-REG OF SV-CONSULTAS-CMC
            MOVE CTA-NSGD-ENTRADA OF SV-CONSULTAS-CMC
               TO CTA-NSGD-AUX-REL
            GO TO NEXT-NSGD-SIDEC-REL
       END-IF
    END-IF

    FIND NEXT SCN-POR-CTA-NSGD
      AT SCN-CONTA-NSGD =
         CTA-NSGD-ENTRADA OF SV-CONSULTAS-CMC
      ON EXCEPTION
         IF DMSTATUS(NOTFOUND)
            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
            GO TO 100-FIM-BUSCAR-NSGD-SIDEC
         ELSE
            CALL SYSTEM DMTERMINATE.

    IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
         ADD 1 TO CONT-REG OF SV-CONSULTAS-CMC
         MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
         PERFORM 0200-MONTA-DETALHE THRU 0200-FIM-MONTA-DETALHE.

    GO TO NEXT-NSGD-SIDEC.

   NEXT-NSGD-SIDEC-REL.

    FIND NEXT SCN-POR-CTA-SIDEC
      AT SCN-CONTA-NSGD =
         CTA-NSGD-AUX-REL
      ON EXCEPTION
         IF DMSTATUS(NOTFOUND)
            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
            GO TO 100-FIM-BUSCAR-SIDEC-NSGD
         ELSE
            CALL SYSTEM DMTERMINATE.

     IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
         ADD 1 TO CONT-REG OF SV-CONSULTAS-CMC
         MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
         PERFORM 0200-MONTA-DETALHE THRU 0200-FIM-MONTA-DETALHE.

    GO TO NEXT-SIDEC-NSGD-REL.


 100-FIM-BUSCAR-NSGD-SIDEC. EXIT.

*----------------------------------------------------------------
*D550134 - SS84955
 100-BUSCAR-NSGD-SIDEC-CONTRATO.

    MOVE "N" TO FLAG-FIM OF SV-CONSULTAS-CMC.

    FIND FIRST SCN-POR-IDENT
      AT CON-IDENTIFICACAO =
         CON-IDENTIFICACAO OF SV-CONSULTAS-CMC
      ON EXCEPTION
         IF DMSTATUS(NOTFOUND)
            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
            MOVE "NAO HA CONTA SIDEC CORRESPONDENTE AO CONTRATO IN
-                "FORMADO."
              TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
            GO TO 100-FIM-BUSCAR-NSGD-SIDEC-CTR
         ELSE
            CALL SYSTEM DMTERMINATE.

    IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
         MOVE 1 TO CONT-REG OF SV-CONSULTAS-CMC
         MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
         PERFORM 0200-MONTA-DETALHE THRU 0200-FIM-MONTA-DETALHE
    ELSE
         MOVE "NAO HA CONTA SIDEC CORRESPONDENTE AO CONTRATO INFOR
-             "MADO." TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC.

 NEXT-NSGD-SIDEC-CONTRATO.

    IF ACAO OF SV-CONSULTAS-CMC = "CON"
      IF CONT-REG OF SV-CONSULTAS-CMC > 50
         MOVE "LIMITE DA TELA EXCEDIDO, PARA VISUALIZAR TODOS OS R
-        "EGISTROS EMITA O RELATORIO" TO MENSAGEM-RESULTADO
         OF SV-CONSULTAS-CMC
         GO TO 100-FIM-BUSCAR-NSGD-SIDEC-CTR
      END-IF
    END-IF

    IF ACAO OF SV-CONSULTAS-CMC  = "REL"
      IF CONT-REG OF SV-CONSULTAS-CMC > 300 AND
         FLAG-FIM OF SV-CONSULTAS-CMC = "N"
            MOVE 0 TO CONT-REG OF SV-CONSULTAS-CMC
            MOVE CON-IDENTIFICACAO OF SV-CONSULTAS-CMC
               TO CON-IDENT-REL
            GO TO NEXT-NSGD-SIDEC-CONTRATO-REL
      END-IF
    END-IF

    FIND NEXT SCN-POR-IDENT
      AT CON-IDENTIFICACAO =
         CON-IDENTIFICACAO OF SV-CONSULTAS-CMC
      ON EXCEPTION
         IF DMSTATUS(NOTFOUND)
            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
            GO TO 100-FIM-BUSCAR-NSGD-SIDEC-CTR
         ELSE
            CALL SYSTEM DMTERMINATE.

    IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
            ADD 1 TO CONT-REG OF SV-CONSULTAS-CMC
            MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
            PERFORM 0200-MONTA-DETALHE
                  THRU 0200-FIM-MONTA-DETALHE.

    GO TO NEXT-NSGD-SIDEC-CONTRATO.

 NEXT-NSGD-SIDEC-CONTRATO-REL.

    FIND NEXT SCN-POR-IDENT
      AT CON-IDENTIFICACAO =
         CON-IDENT-REL
      ON EXCEPTION
         IF DMSTATUS(NOTFOUND)
            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
            GO TO 100-FIM-BUSCAR-NSGD-SIDEC-CTR
         ELSE
            CALL SYSTEM DMTERMINATE.

    IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
            ADD 1 TO CONT-REG OF SV-CONSULTAS-CMC
            MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
            PERFORM 0200-MONTA-DETALHE
                  THRU 0200-FIM-MONTA-DETALHE.

    GO TO NEXT-NSGD-SIDEC-CONTRATO-REL.

 100-FIM-BUSCAR-NSGD-SIDEC-CTR.
 EXIT.
*D550134 - SS84955

 0200-MONTA-DETALHE.

   MOVE CON-IDENTIFICACAO OF SIDEC-CTA-NSGD
      TO CTR-ENTRADA
               OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SCN-UNO-SIDEC     OF SIDEC-CTA-NSGD
      TO SCN-UNO-SIDEC
               OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SCN-CONTA-SIDEC   OF SIDEC-CTA-NSGD
      TO SCN-CONTA-SIDEC
               OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SCN-UNO-NSGD      OF SIDEC-CTA-NSGD
      TO SCN-UNO-NSGD
               OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SCN-PRD-NSGD      OF SIDEC-CTA-NSGD
      TO SCN-PRD-NSGD
               OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SCN-CONTA-NSGD    OF SIDEC-CTA-NSGD
      TO SCN-CONTA-NSGD
               OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SCN-DIGITO-NSGD   OF SIDEC-CTA-NSGD
      TO SCN-DIGITO-NSGD
               OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SPACES TO SCN-TIPO-CONTA OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE ZEROS TO SCN-AG-DV OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE ZEROS TO SCN-CONTA OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE ZEROS TO SCN-DIGITO OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SCN-SEC-MIGRACAO  OF SIDEC-CTA-NSGD
      TO SCN-SEC-MIGRACAO
               OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SCN-ANO-MIGRACAO  OF SIDEC-CTA-NSGD
      TO SCN-ANO-MIGRACAO
               OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SCN-MES-MIGRACAO  OF SIDEC-CTA-NSGD
      TO SCN-MES-MIGRACAO
               OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SCN-DIA-MIGRACAO  OF SIDEC-CTA-NSGD
      TO SCN-DIA-MIGRACAO
               OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SCN-SEC-INCLUSAO  OF SIDEC-CTA-NSGD
      TO SCN-SEC-INCLUSAO
               OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SCN-ANO-INCLUSAO  OF SIDEC-CTA-NSGD
      TO SCN-ANO-INCLUSAO
               OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SCN-MES-INCLUSAO  OF SIDEC-CTA-NSGD
      TO SCN-MES-INCLUSAO
               OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SCN-DIA-INCLUSAO  OF SIDEC-CTA-NSGD
      TO SCN-DIA-INCLUSAO
               OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SCN-SIGLA-BANCO   OF SIDEC-CTA-NSGD
      TO SCN-SIGLA-BANCO
               OF SV-CONSULTAS-CMC(CONT-REG).

    IF SCN-COD-TABELA    OF SIDEC-CTA-NSGD EQUAL 002

          MOVE SCN-CHAVE-TAB OF SIDEC-CTA-NSGD
            TO SCN-CHAVE-TAB-WS

          INITIALIZE SCN-CHAVE-TAB-WS-DOM

          STRING SCN-CHAVE-TAB-WS(1:3)
               DELIMITED BY SIZE
               INTO SCN-CHAVE-TAB-WS-DOM
          END-STRING

           MOVE SCN-CHAVE-TAB-WS-DOM
                TO SCN-PARTICIPANTE
                     OF SV-CONSULTAS-CMC(CONT-REG)

          INITIALIZE SCN-CHAVE-TAB-WS-1

          STRING SCN-CHAVE-TAB-WS(5:25)
               DELIMITED BY SIZE
               INTO SCN-CHAVE-TAB-WS-1
          END-STRING

          MOVE SCN-CHAVE-TAB-WS-1
            TO SCN-CHAVE-TAB
                  OF SV-CONSULTAS-CMC(CONT-REG).

    EVALUATE SCN-CHAVE-TAB-WS-DOM
        WHEN "MUT"
            MOVE "Mutuario" TO SCN-DET-PART
                            OF SV-CONSULTAS-CMC(CONT-REG)
        WHEN "CSV"
            MOVE "Conta Vinc.Mutuario" TO SCN-DET-PART
                            OF SV-CONSULTAS-CMC(CONT-REG)
        WHEN "VEC"
            MOVE "Vendedor" TO SCN-DET-PART
                            OF SV-CONSULTAS-CMC(CONT-REG)
        WHEN "UNO"
            MOVE "UNO" TO SCN-DET-PART
                            OF SV-CONSULTAS-CMC(CONT-REG)
        WHEN "CNV"
            MOVE "Convenio" TO SCN-DET-PART
                            OF SV-CONSULTAS-CMC(CONT-REG)
        WHEN "EMP"
            MOVE "Empresas" TO SCN-DET-PART
                            OF SV-CONSULTAS-CMC(CONT-REG)
        WHEN "AGE"
            MOVE "Agente(Prestador de Servico)"
               TO SCN-DET-PART
                            OF SV-CONSULTAS-CMC(CONT-REG)
        WHEN "EPR"
            MOVE "Empreendimento" TO SCN-DET-PART
                            OF SV-CONSULTAS-CMC(CONT-REG).

    MOVE SCN-COD-TABELA    OF SIDEC-CTA-NSGD
      TO SCN-SITUACAO      OF SV-CONSULTAS-CMC(CONT-REG).

    EVALUATE SCN-SITUACAO OF SV-CONSULTAS-CMC(CONT-REG)
        WHEN 002
            MOVE "Conta migrada com sucesso"
                  TO SCN-DET-SITUAC
                        OF SV-CONSULTAS-CMC(CONT-REG)
        WHEN 003
            MOVE "Conta ja migrada"
                  TO SCN-DET-SITUAC
                        OF SV-CONSULTAS-CMC(CONT-REG)
        WHEN 004
            MOVE "Conta inexistente no SIACI"
                  TO SCN-DET-SITUAC
                        OF SV-CONSULTAS-CMC(CONT-REG)
        WHEN 005
            MOVE "Codigo da Operacao com restricao para migracao"
                  TO SCN-DET-SITUAC
                        OF SV-CONSULTAS-CMC(CONT-REG)
        WHEN 006
            MOVE "Codigo do Produto com restricao para migracao"
                  TO SCN-DET-SITUAC
                        OF SV-CONSULTAS-CMC(CONT-REG)
        WHEN 007
            MOVE "Codigo da Agencia invalido"
                  TO SCN-DET-SITUAC
                        OF SV-CONSULTAS-CMC(CONT-REG)
        WHEN 008
            MOVE "Conta nao migrada para contrato encerrado"
                  TO SCN-DET-SITUAC
                        OF SV-CONSULTAS-CMC(CONT-REG).

*    MOVE SCN-CHAVE-TAB     OF SIDEC-CTA-NSGD
*      TO SCN-CHAVE-TAB
*            OF SV-CONSULTAS-CMC(CONT-REG).

 0200-FIM-MONTA-DETALHE.  EXIT.

* 0300-RELATORIO.

*     PERFORM 050-BUSCAR-CONTAS THRU 050-FIM-CONSULTA.




* 0300-FIM-RELATORIO.
* EXIT.


 FIM-PROGRAMA.
   EXIT.
