000000*
000000*
000000*            ********************************************
000000*            *                                          *
000000*            *      ####   #   #####   ####   #         *
000000*            *      #      #   #   #   #      #         *
000000*            *      ####   #   #####   #      #         *
000000*            *         #   #   #   #   #      #         *
000000*            *      ####   #   #   #   ####   #         *
000000*            *                                          *
000000*            *  SISTEMA INTEGRADO DE ADMINISTRACAO DA   *
000000*            *                                          *
000000*            *         CARTEIRA IMOBILIARIA             *
000000*            *                                          *
000000*            *                                          *
000000*            *         MODULO DE PAGAMENTOS             *
000000*            *                                          *
000000*            *                                          *
000000*            *         CMC - CONSULTA MIGRACAO          *
000000*            *                  DE CONTAS               *
000000*            *                                          *
000000*            *           DATAMEC S/A   -  BHZ           *
000000*            *                                          *
000000*            ********************************************
000000*TH ESTE PROGRAMA FOI COPIADO A PARTIR DO PROGRAMA 215 CPG
000000/
000000$SET LIST LINEINFO ERRORLIST FREE FEDLEVEL = 5 INTEGERBNRY
000000$SET LEVEL = 3 BINDINFO
000000*$TADS
000000$SET BINDINFO
000000*
000000 IDENTIFICATION DIVISION.
000000*
000000 PROGRAM-ID.     S0347-FTE-445.
000000*
000000 ENVIRONMENT DIVISION.
000000*
000000******************************************************************
000000*  ESTE PROGRAMA DEVE SER COMPILADO COM O COMPILADOR BDMSCOBOL85 *
000000*  E COM A OPCAO $FEDLEVEL = 5 (COBOL74 COM EXTENSAO BURROUGHS). *
000000******************************************************************
000000*
000000 CONFIGURATION SECTION.
000000 SOURCE-COMPUTER. A15.
000000 OBJECT-COMPUTER. A15.
000000 SPECIAL-NAMES.
000000          DICTIONARY IS "SCREENDESIGN",
000000          PROGRAM-NAME IS "PRG-CONSULTA-PAG".
000000*
000000 DATA DIVISION.
000000*
000000 DATA-BASE SECTION.
000000 DB BDCADASTRO   OF BDSIACI COMMON ALL.
000000 DB BDPARAMETROS OF BDSIACIPAR COMMON ALL.
000000 DB BDSIACISEC              COMMON ALL.
000000*
000000 WORKING-STORAGE SECTION.
000000*
000000 01 NUMERO-PAGINA-WS    REAL.
000000 01 COLUNA-INICIAL-WS   REAL.
000000 01 LINHA-INICIAL-WS    REAL.
000000 01 TAMANHO-TELA-WS     REAL.
000000
000000 77  SEND-PAGINADOR-77            PIC 9(01) COMMON.
000000
000000 77  AGENDA-DESTINO-77            REAL COMMON.
000000 77  AGENDA-INPUT-77              REAL COMMON.
000000 77  PROGRAMA-DESIGNATOR-77       REAL COMMON.
000000 77  RESULTADO-77                 PIC S9(11) BINARY EXTENDED.
000000 77  CONSISTE-77                  PIC 9.
000000 77  IND-SEQ                      PIC 99.
000000 77  IND                          PIC 99.
000000 77  IND-77                       PIC 99.
000000 77  IND-POS                      PIC 99 VALUE ZEROS.
000000 77  CH-ACHOU-PAGTO               PIC X  VALUE SPACES.
000000 77  PRIMEIRA-VEZ                 PIC 9  VALUE ZEROS.
000000 77  SCN-COD-TABELA-WS            PIC X(03).
000000 77  SCN-CHAVE-TAB-WS             PIC X(30) VALUE SPACES.
000000 77  SCN-CHAVE-TAB-WS-DOM         PIC X(03) VALUE SPACES.
000000 77  SCN-CHAVE-TAB-WS-1           PIC X(30) VALUE SPACES.
000000 77  SCN-CHAVE-TAB-WS-1-DOM       PIC X(03) VALUE SPACES.
000000
000000* VARIAVEIS 77 NOVAS
000000 77  WINDOW-DESIGNATOR-77        REAL.
000000 77  ESTACAO-REAL-77             REAL.
000000 77  STATION-DESIG-77            PIC S9(11)  BINARY.
000000 77  STATION-DEVICE-77           PIC S9(11)  BINARY.
000000 77  STATION-LSN-77              PIC S9(11)  BINARY.
000000 77  STATION-SEC-77              PIC S9(11)  BINARY.
000000 77  IND-SEC-GLOBAL-77           PIC 9(02).
000000 77  CODIGO-INFORMACAO-77        PIC S9(11) BINARY EXTENDED.
000000 77  ENVIA-TELA-77               PIC S9(11)  BINARY EXTENDED.
000000
000000 01 CON-IDENT-REL                PIC 9(12).
000000 01 UNO-SIDEC-AUX-REL            PIC 9(05).
000000 01 CTA-SIDEC-AUX-REL            PIC 9(12).
000000 01 CTA-NSGD-AUX-REL             PIC 9(12).
000000
000000*
000000*----------------------------------------------------------------*
000000* VALORES ASSUMIDOS PELOS CAMPOS DO HEADER E USADOS NO PROGRAMA  *
000000*----------------------------------------------------------------*
000000
000000 01 VALORES-STATUSVALUE-IN USAGE BINARY.
000000    03 FINALIZAR                    PIC S9(11) BINARY VALUE 99.
000000
000000 01 VALORES-STATUSVALUE-OUT       USAGE BINARY EXTENDED.
000000*
000000     03 SEND-SEM-ERRO             PIC S9(11) BINARY EXTENDED VALUE
000000     00                                                     .
000000     03 RECUPERACAO-SINCRONIZADA  PIC S9(11) BINARY EXTENDED VALUE
000000     92                                                     .
000000     03 DESTINO-INVALIDO          PIC S9(11) BINARY EXTENDED VALUE
000000     94                                                     .
000000     03 DESIGNATOR-AG-INVALIDO    PIC S9(11) BINARY EXTENDED VALUE
000000     95                                                     .
000000     03 MSG-PARADA-ITEM-PROC      PIC S9(11) BINARY EXTENDED VALUE
000000     96                                                     .
000000     03 DESTINO-DESABILITADO      PIC S9(11) BINARY EXTENDED VALUE
000000     97                                                     .
000000     03 IP-NDISP-OU-ERRO-SEG      PIC S9(11) BINARY EXTENDED VALUE
000000     98                                                     .
000000*
000000***
000000* AREA DE INPUT HEADER PARA PASSAGEM DE PARAMETROS
000000***
000000*
000000 01 ARRAY-IN-WS USAGE             REAL COMMON.
000000*
000000    03 PROGRAMDESG-WS             REAL.
000000    03 FUNCTIONINDEX-WS           REAL.
000000    03 USERCODE-WS                REAL.
000000    03 SECURITYDESG-WS            REAL.
000000    03 FIELDS-WS                  REAL.
000000    03 TIMESTAMP-WS               REAL.
000000    03 STATION-WS                 REAL.
000000    03 TEXTLENGTH-WS              REAL.
000000    03 FILLER-WS                  REAL.
000000    03 STATUSVALUE-WS             REAL.
000000    03 RESTART-WS                 REAL.
000000    03 AGENDA-WS                  REAL.
000000    03 SDFINFO-WS                 REAL.
000000    03 FORM-KEY-WS                REAL.
000000    03 SDFTRANSNUM                REAL.
000000    03 SDFFORMRECNUM-WS           REAL.
000000
000000 01 SV-CONSULTAS-CMC COMMON.
000000    COPY "S0347/LIB/SRV/V034744501".
000000*
000000 01 SV-AREA-ESTACAO COMMON.
000000    COPY "(PROJETO)S0347/LIB/02/AREA/ESTACAO ON PROJETO01".
000000*
000000 01 SV-AREA-ACESSO.
000000    COPY "(PROJETO)S0347/LIB/124/ACESSO      ON PROJETO01".
000000/
000000 COMMUNICATION SECTION.
000000*
000000 INPUT HEADER COMS-IN
000000     CONVERSATION AREA.
000000     02 CONVERSATION-AREA         REAL.
000000         03 FORM-KEY-IN           REAL.
000000 OUTPUT HEADER COMS-OUT
000000     CONVERSATION AREA.
000000     02 CONVERSATION-AREA         REAL.
000000         03 FORM-KEY-OUT          REAL.
000000         03 PAGINADOR-OUT         REAL.
000000/
000000 LOCAL-STORAGE SECTION.
000000
000000  COPY "(PROJETO)S0347/LIB/00/LIB101/PARAMETROS ON PROJETO01".
000000
000000  COPY "(PROJETO)S0997/LIB/00/INST/PARAMETROS ON PROJETO01".
000000
000000 PROGRAM-LIBRARY SECTION.
000000
000000  COPY "(PROJETO)S0347/LIB/00/LIB101/ENTRYPOINTS ON PROJETO01".
000000
000000$SET LIBINST_TRATA_ERRO_SAIDA
000000
000000 COPY "(PROJETO)S0997/LIB/00/INST/ENTRYPOINTS ON PROJETO01".
000000*
000000 PROCEDURE DIVISION.
000000*
000000 CORPO-PROG SECTION.
000000*
000000 001-INI-PROGRAMA.
000000*
000000*---
000000* Inicializar areas declaradas como "OWN".
000000* Areas declaradas assim melhoram a performance do programa
000000* evitando que ele faca novamente o processo de alocacao.
000000* Toda nova variavel devera ser reinicializa, pois seu valor sera
000000* mantido na memoria numa proxima chamada do programa.
000000* Campos "FILLER" sao ignorados pelo comando "INITIALIZE",
000000* permanecendo com o valor descrito na clausula "VALUE".
000000* JAN/2001.
000000*---
000000
000000     INITIALIZE RESULTADO-77            CONSISTE-77
000000                IND-SEQ                 IND
000000                IND-77                  IND-POS.
000000
000000 010-INICIO-CONSULTAS-CMC.
000000
000000     MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC.
000000
000000     PERFORM 020-ACAO THRU 020-FIM-ACAO.
000000
000000     GO TO FIM-PROGRAMA.
000000
000000 010-FIM-CONSULTAS-CMC.
000000   EXIT.
000000
000000 020-ACAO.
000000     MOVE ZEROS TO CONT-REG OF SV-CONSULTAS-CMC.
000000
000000     IF ACAO OF SV-CONSULTAS-CMC = "CON" OR "LIM" OR "REL"
000000        CONTINUE
000000     ELSE
000000        MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
000000        MOVE "ACAO INVALIDA." TO MENSAGEM-RESULTADO
000000                                   OF SV-CONSULTAS-CMC
000000        GO TO 020-FIM-ACAO.
000000
000000     IF ACAO OF SV-CONSULTAS-CMC  = "CON" OR "REL"
000000*       GO TO 050-BUSCAR-CONTAS.
000000        PERFORM 050-BUSCAR-CONTAS THRU 050-FIM-CONSULTA.
000000
000000     IF ACAO OF SV-CONSULTAS-CMC = "LIM"
000000*       GO TO 090-LIMPA.
000000        PERFORM 090-LIMPA THRU 090-FIM-LIMPA.
000000
000000*     IF ACAO OF SV-CONSULTAS-CMC = "REL"
000000*        PERFORM 0300-RELATORIO THRU 0300-FIM-RELATORIO.
000000
000000 020-FIM-ACAO.
000000   EXIT.
000000
000000 050-BUSCAR-CONTAS.
000000
000000* PADRAO-CONTA = 0 BUSCAR CONTA NSGD POR CONTA SIDEC
000000     IF PADRAO-CONTA OF SV-CONSULTAS-CMC = 0 OR 1 OR 2 OR 3
000000        CONTINUE
000000     ELSE
000000        MOVE "PADRAO CONTA INVALIDO."
000000        TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000        GO TO 050-FIM-CONSULTA.
000000
000000     IF PADRAO-CONTA OF SV-CONSULTAS-CMC = 0
000000        IF UNO-SIDEC-ENTRADA OF SV-CONSULTAS-CMC = ZEROS
000000           MOVE "FAVOR INFORMAR UMA AGENCIA SIDEC."
000000           TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000           MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
000000           MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
000000        END-IF
000000
000000        IF CTA-SIDEC-ENTRADA OF SV-CONSULTAS-CMC = ZEROS
000000           MOVE "FAVOR INFORMAR UMA CONTA CORRENTE SIDEC."
000000           TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000           MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
000000           MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
000000        END-IF
000000
000000        IF CTA-SIDEC-ENTRADA OF SV-CONSULTAS-CMC = ZEROS AND
000000           UNO-SIDEC-ENTRADA OF SV-CONSULTAS-CMC = ZEROS
000000           MOVE "FAVOR INFORMAR UMA CONTA E UMA AGENCIA SIDEC."
000000           TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000           MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
000000           MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
000000        END-IF
000000
000000        IF CODIGO-RESULTADO OF SV-CONSULTAS-CMC = 1
000000           GO TO 050-FIM-CONSULTA
000000        END-IF
000000
000000        PERFORM 100-BUSCAR-SIDEC-NSGD
000000           THRU 100-FIM-BUSCAR-SIDEC-NSGD
000000
000000     END-IF.
000000
000000* PADRAO-CONTA = 1 BUSCAR CONTA SIDEC POR CONTA NSGD
000000
000000     IF PADRAO-CONTA OF SV-CONSULTAS-CMC = 1
000000        IF CTA-NSGD-ENTRADA OF SV-CONSULTAS-CMC = ZEROS
000000           MOVE "FAVOR INFORMAR A CONTA CORRENTE NSGD."
000000           TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000           MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
000000           MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
000000        END-IF
000000
000000        IF PRD-NSGD-ENTRADA OF SV-CONSULTAS-CMC = ZEROS
000000           MOVE "FAVOR INFORMAR O PRODUTO NSGD."
000000           TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000           MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
000000           MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
000000        END-IF
000000
000000        IF PRD-NSGD-ENTRADA OF SV-CONSULTAS-CMC = ZEROS AND
000000           CTA-NSGD-ENTRADA OF SV-CONSULTAS-CMC = ZEROS
000000           MOVE "FAVOR INFORMAR O PRODUTO E A CONTA NSGD."
000000           TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000           MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
000000           MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
000000        END-IF
000000
000000        IF CODIGO-RESULTADO OF SV-CONSULTAS-CMC = 1
000000           GO TO 050-FIM-CONSULTA
000000        END-IF
000000
000000        PERFORM 100-BUSCAR-NSGD-SIDEC
000000           THRU 100-FIM-BUSCAR-NSGD-SIDEC
000000
000000     END-IF.
000000
000000* PADRAO-CONTA = 2 BUSCAR CONTA POR CONTRATO
000000     IF PADRAO-CONTA OF SV-CONSULTAS-CMC = 2
000000        IF CON-IDENTIFICACAO OF SV-CONSULTAS-CMC = ZEROS
000000           MOVE "FAVOR INFORMAR UM CONTRATO VIGENTE."
000000           TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000*D550134 - ALTERACAO INFO VAZIA
000000           MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
000000           MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
000000           GO TO 050-FIM-CONSULTA
000000        END-IF
000000
000000        PERFORM 100-BUSCAR-NSGD-SIDEC-CONTRATO
000000           THRU 100-FIM-BUSCAR-NSGD-SIDEC-CTR
000000
000000     END-IF.
000000
000000 050-FIM-CONSULTA.
000000   EXIT.
000000
000000 090-LIMPA.
000000*
000000*     MOVE "CON"  TO ACAO     OF SV-CONSULTAS-CMC.
000000     MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC.
000000     MOVE 3 TO PADRAO-CONTA OF SV-CONSULTAS-CMC.
000000     MOVE "V034744501" TO TRANCODE OF SV-CONSULTAS-CMC
000000                          TRANCODE OF SV-AREA-ESTACAO
000000                          TRANCODE-VOL OF SV-AREA-ESTACAO.
000000     MOVE ZEROS  TO CONT-REG
000000                              OF SV-CONSULTAS-CMC
000000                    SCN-UNO-SIDEC
000000                              OF SV-CONSULTAS-CMC(1)
000000                    SCN-CONTA-SIDEC
000000                              OF SV-CONSULTAS-CMC(1)
000000                    SCN-UNO-NSGD
000000                              OF SV-CONSULTAS-CMC(1)
000000                    SCN-CONTA-NSGD
000000                              OF SV-CONSULTAS-CMC(1)
000000                    SCN-DIGITO-NSGD
000000                              OF SV-CONSULTAS-CMC(1)
000000                    CTR-ENTRADA
000000                              OF SV-CONSULTAS-CMC(1).
000000*                    CONTA-LINHAS-WK.
000000*  INITIALIZE SV-CONSULTAS-CMC.
000000
000000 090-FIM-LIMPA.
000000     EXIT.
000000
000000 100-BUSCAR-SIDEC-NSGD.
000000    MOVE "N" TO FLAG-FIM OF SV-CONSULTAS-CMC.
000000*    MOVE 1 TO CONT-REG OF SV-CONSULTAS-CMC.
000000
000000    FIND FIRST SCN-POR-CTA-SIDEC
000000      AT SCN-UNO-SIDEC =
000000         UNO-SIDEC-ENTRADA OF SV-CONSULTAS-CMC
000000     AND SCN-CONTA-SIDEC =
000000         CTA-SIDEC-ENTRADA OF SV-CONSULTAS-CMC
000000      ON EXCEPTION
000000         IF DMSTATUS(NOTFOUND)
000000            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
000000            MOVE "NAO HA CONTA NSGD CORRESPONDENTE A CONTA SIDEC I
000000-                "NFORMADA." TO MENSAGEM-RESULTADO
000000                               OF SV-CONSULTAS-CMC
000000            GO TO 100-FIM-BUSCAR-SIDEC-NSGD
000000         ELSE
000000            CALL SYSTEM DMTERMINATE.
000000
000000    IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
000000       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
000000         MOVE 1 TO CONT-REG OF SV-CONSULTAS-CMC
000000         MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000         PERFORM 0200-MONTA-DETALHE THRU 0200-FIM-MONTA-DETALHE
000000    ELSE
000000         MOVE "NAO HA CONTA NSGD CORRESPONDENTE A CONTA SIDEC INFO
000000-             "RMADA." TO MENSAGEM-RESULTADO.
000000
000000 NEXT-SIDEC-NSGD.
000000
000000    IF ACAO OF SV-CONSULTAS-CMC = "CON"
000000      IF CONT-REG OF SV-CONSULTAS-CMC > 50
000000         MOVE "LIMITE DA TELA EXCEDIDO, PARA VISUALIZAR TODOS OS R
000000-        "EGISTROS EMITA O RELATORIO" TO MENSAGEM-RESULTADO
000000         OF SV-CONSULTAS-CMC
000000         GO TO 100-FIM-BUSCAR-SIDEC-NSGD
000000      END-IF
000000    END-IF
000000
000000    IF ACAO OF SV-CONSULTAS-CMC  = "REL"
000000      IF CONT-REG OF SV-CONSULTAS-CMC > 300 AND
000000         FLAG-FIM OF SV-CONSULTAS-CMC = "N"
000000            MOVE 0 TO CONT-REG OF SV-CONSULTAS-CMC
000000            MOVE UNO-SIDEC-ENTRADA OF SV-CONSULTAS-CMC
000000               TO UNO-SIDEC-AUX-REL
000000            MOVE CTA-SIDEC-ENTRADA OF SV-CONSULTAS-CMC
000000               TO CTA-SIDEC-AUX-REL
000000            GO TO NEXT-SIDEC-NSGD-REL
000000       END-IF
000000    END-IF
000000
000000    FIND NEXT SCN-POR-CTA-SIDEC
000000      AT SCN-UNO-SIDEC =
000000         UNO-SIDEC-ENTRADA OF SV-CONSULTAS-CMC
000000     AND SCN-CONTA-SIDEC =
000000         CTA-SIDEC-ENTRADA OF SV-CONSULTAS-CMC
000000      ON EXCEPTION
000000         IF DMSTATUS(NOTFOUND)
000000            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
000000            GO TO 100-FIM-BUSCAR-SIDEC-NSGD
000000         ELSE
000000            CALL SYSTEM DMTERMINATE.
000000
000000    IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
000000       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
000000         ADD 1 TO CONT-REG OF SV-CONSULTAS-CMC
000000         MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000         PERFORM 0200-MONTA-DETALHE THRU 0200-FIM-MONTA-DETALHE.
000000
000000    GO TO NEXT-SIDEC-NSGD.
000000
000000 NEXT-SIDEC-NSGD-REL.
000000
000000    FIND NEXT SCN-POR-CTA-SIDEC
000000      AT SCN-UNO-SIDEC =
000000         UNO-SIDEC-AUX-REL
000000     AND SCN-CONTA-SIDEC =
000000         CTA-SIDEC-AUX-REL
000000      ON EXCEPTION
000000         IF DMSTATUS(NOTFOUND)
000000            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
000000            GO TO 100-FIM-BUSCAR-SIDEC-NSGD
000000         ELSE
000000            CALL SYSTEM DMTERMINATE.
000000
000000     IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
000000       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
000000         ADD 1 TO CONT-REG OF SV-CONSULTAS-CMC
000000         MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000         PERFORM 0200-MONTA-DETALHE THRU 0200-FIM-MONTA-DETALHE.
000000
000000    GO TO NEXT-SIDEC-NSGD-REL.
000000
000000 100-FIM-BUSCAR-SIDEC-NSGD.
000000 EXIT.
000000*-----------------------------------------------------------------
000000
000000 100-BUSCAR-NSGD-SIDEC.
000000
000000    MOVE "N" TO FLAG-FIM OF SV-CONSULTAS-CMC.
000000*    MOVE 1 TO CONT-REG OF SV-CONSULTAS-CMC.
000000
000000    FIND FIRST SCN-POR-CTA-NSGD
000000      AT SCN-CONTA-NSGD =
000000         CTA-NSGD-ENTRADA OF SV-CONSULTAS-CMC AND
000000         SCN-PRD-NSGD =
000000         PRD-NSGD-ENTRADA OF SV-CONSULTAS-CMC
000000      ON EXCEPTION
000000         IF DMSTATUS(NOTFOUND)
000000            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
000000            MOVE "NAO HA CONTA SIDEC CORRESPONDENTE A CONTA NSGD I
000000-                "NFORMADA."
000000              TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000            MOVE 1 TO CODIGO-RESULTADO OF SV-CONSULTAS-CMC
000000*D550134 - BG248038
000000            MOVE ZEROS TO SCN-UNO-SIDEC
000000*                           OF SV-CONSULTAS-CMC(CONT-REG)
000000                          OF SV-CONSULTAS-CMC(1)
000000                          SCN-CONTA-SIDEC
000000*                           OF SV-CONSULTAS-CMC(CONT-REG)
000000                          OF SV-CONSULTAS-CMC(1)
000000*D550134 - BG248038
000000            GO TO 100-FIM-BUSCAR-NSGD-SIDEC
000000         ELSE
000000            CALL SYSTEM DMTERMINATE.
000000
000000    IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
000000       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
000000         MOVE 1 TO CONT-REG OF SV-CONSULTAS-CMC
000000         MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000         PERFORM 0200-MONTA-DETALHE THRU 0200-FIM-MONTA-DETALHE
000000    ELSE
000000       MOVE "NAO HA CONTA SIDEC CORRESPONDENTE A CONTA NSGD INFORM
000000-           "ADA." TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC.
000000
000000*    MOVE ZEROS TO SCN-UNO-SIDEC   OF SV-CONSULTAS-CMC
000000*                  SCN-CONTA-SIDEC OF SV-CONSULTAS-CMC.
000000
000000  NEXT-NSGD-SIDEC.
000000    IF ACAO OF SV-CONSULTAS-CMC = "CON"
000000      IF CONT-REG OF SV-CONSULTAS-CMC > 50
000000         MOVE "LIMITE DA TELA EXCEDIDO, PARA VISUALIZAR TODOS OS R
000000-        "EGISTROS EMITA O RELATORIO" TO MENSAGEM-RESULTADO
000000         OF SV-CONSULTAS-CMC
000000         GO TO  100-FIM-BUSCAR-NSGD-SIDEC
000000      END-IF
000000    END-IF
000000
000000    IF ACAO OF SV-CONSULTAS-CMC  = "REL"
000000      IF CONT-REG OF SV-CONSULTAS-CMC > 300 AND
000000         FLAG-FIM OF SV-CONSULTAS-CMC = "N"
000000            MOVE 0 TO CONT-REG OF SV-CONSULTAS-CMC
000000            MOVE CTA-NSGD-ENTRADA OF SV-CONSULTAS-CMC
000000               TO CTA-NSGD-AUX-REL
000000            GO TO NEXT-NSGD-SIDEC-REL
000000       END-IF
000000    END-IF
000000
000000    FIND NEXT SCN-POR-CTA-NSGD
000000      AT SCN-CONTA-NSGD =
000000         CTA-NSGD-ENTRADA OF SV-CONSULTAS-CMC
000000      ON EXCEPTION
000000         IF DMSTATUS(NOTFOUND)
000000            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
000000            GO TO 100-FIM-BUSCAR-NSGD-SIDEC
000000         ELSE
000000            CALL SYSTEM DMTERMINATE.
000000
000000    IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
000000       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
000000         ADD 1 TO CONT-REG OF SV-CONSULTAS-CMC
000000         MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000         PERFORM 0200-MONTA-DETALHE THRU 0200-FIM-MONTA-DETALHE.
000000
000000    GO TO NEXT-NSGD-SIDEC.
000000
000000   NEXT-NSGD-SIDEC-REL.
000000
000000    FIND NEXT SCN-POR-CTA-SIDEC
000000      AT SCN-CONTA-NSGD =
000000         CTA-NSGD-AUX-REL
000000      ON EXCEPTION
000000         IF DMSTATUS(NOTFOUND)
000000            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
000000            GO TO 100-FIM-BUSCAR-SIDEC-NSGD
000000         ELSE
000000            CALL SYSTEM DMTERMINATE.
000000
000000     IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
000000       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
000000         ADD 1 TO CONT-REG OF SV-CONSULTAS-CMC
000000         MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000         PERFORM 0200-MONTA-DETALHE THRU 0200-FIM-MONTA-DETALHE.
000000
000000    GO TO NEXT-SIDEC-NSGD-REL.
000000
000000
000000 100-FIM-BUSCAR-NSGD-SIDEC. EXIT.
000000
000000*----------------------------------------------------------------
000000*D550134 - SS84955
000000 100-BUSCAR-NSGD-SIDEC-CONTRATO.
000000
000000    MOVE "N" TO FLAG-FIM OF SV-CONSULTAS-CMC.
000000
000000    FIND FIRST SCN-POR-IDENT
000000      AT CON-IDENTIFICACAO =
000000         CON-IDENTIFICACAO OF SV-CONSULTAS-CMC
000000      ON EXCEPTION
000000         IF DMSTATUS(NOTFOUND)
000000            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
000000            MOVE "NAO HA CONTA SIDEC CORRESPONDENTE AO CONTRATO IN
000000-                "FORMADO."
000000              TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000            GO TO 100-FIM-BUSCAR-NSGD-SIDEC-CTR
000000         ELSE
000000            CALL SYSTEM DMTERMINATE.
000000
000000    IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
000000       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
000000         MOVE 1 TO CONT-REG OF SV-CONSULTAS-CMC
000000         MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000         PERFORM 0200-MONTA-DETALHE THRU 0200-FIM-MONTA-DETALHE
000000    ELSE
000000         MOVE "NAO HA CONTA SIDEC CORRESPONDENTE AO CONTRATO INFOR
000000-             "MADO." TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC.
000000
000000 NEXT-NSGD-SIDEC-CONTRATO.
000000
000000    IF ACAO OF SV-CONSULTAS-CMC = "CON"
000000      IF CONT-REG OF SV-CONSULTAS-CMC > 50
000000         MOVE "LIMITE DA TELA EXCEDIDO, PARA VISUALIZAR TODOS OS R
000000-        "EGISTROS EMITA O RELATORIO" TO MENSAGEM-RESULTADO
000000         OF SV-CONSULTAS-CMC
000000         GO TO 100-FIM-BUSCAR-NSGD-SIDEC-CTR
000000      END-IF
000000    END-IF
000000
000000    IF ACAO OF SV-CONSULTAS-CMC  = "REL"
000000      IF CONT-REG OF SV-CONSULTAS-CMC > 300 AND
000000         FLAG-FIM OF SV-CONSULTAS-CMC = "N"
000000            MOVE 0 TO CONT-REG OF SV-CONSULTAS-CMC
000000            MOVE CON-IDENTIFICACAO OF SV-CONSULTAS-CMC
000000               TO CON-IDENT-REL
000000            GO TO NEXT-NSGD-SIDEC-CONTRATO-REL
000000      END-IF
000000    END-IF
000000
000000    FIND NEXT SCN-POR-IDENT
000000      AT CON-IDENTIFICACAO =
000000         CON-IDENTIFICACAO OF SV-CONSULTAS-CMC
000000      ON EXCEPTION
000000         IF DMSTATUS(NOTFOUND)
000000            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
000000            GO TO 100-FIM-BUSCAR-NSGD-SIDEC-CTR
000000         ELSE
000000            CALL SYSTEM DMTERMINATE.
000000
000000    IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
000000       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
000000            ADD 1 TO CONT-REG OF SV-CONSULTAS-CMC
000000            MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000            PERFORM 0200-MONTA-DETALHE
000000                  THRU 0200-FIM-MONTA-DETALHE.
000000
000000    GO TO NEXT-NSGD-SIDEC-CONTRATO.
000000
000000 NEXT-NSGD-SIDEC-CONTRATO-REL.
000000
000000    FIND NEXT SCN-POR-IDENT
000000      AT CON-IDENTIFICACAO =
000000         CON-IDENT-REL
000000      ON EXCEPTION
000000         IF DMSTATUS(NOTFOUND)
000000            MOVE "S" TO FLAG-FIM OF SV-CONSULTAS-CMC
000000            GO TO 100-FIM-BUSCAR-NSGD-SIDEC-CTR
000000         ELSE
000000            CALL SYSTEM DMTERMINATE.
000000
000000    IF SCN-COD-TABELA OF SIDEC-CTA-NSGD >= 002 AND
000000       SCN-COD-TABELA OF SIDEC-CTA-NSGD <= 008
000000            ADD 1 TO CONT-REG OF SV-CONSULTAS-CMC
000000            MOVE SPACES TO MENSAGEM-RESULTADO OF SV-CONSULTAS-CMC
000000            PERFORM 0200-MONTA-DETALHE
000000                  THRU 0200-FIM-MONTA-DETALHE.
000000
000000    GO TO NEXT-NSGD-SIDEC-CONTRATO-REL.
000000
000000 100-FIM-BUSCAR-NSGD-SIDEC-CTR.
000000 EXIT.
000000*D550134 - SS84955
000000
000000 0200-MONTA-DETALHE.
000000
000000   MOVE CON-IDENTIFICACAO OF SIDEC-CTA-NSGD
000000      TO CTR-ENTRADA
000000               OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SCN-UNO-SIDEC     OF SIDEC-CTA-NSGD
000000      TO SCN-UNO-SIDEC
000000               OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SCN-CONTA-SIDEC   OF SIDEC-CTA-NSGD
000000      TO SCN-CONTA-SIDEC
000000               OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SCN-UNO-NSGD      OF SIDEC-CTA-NSGD
000000      TO SCN-UNO-NSGD
000000               OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SCN-PRD-NSGD      OF SIDEC-CTA-NSGD
000000      TO SCN-PRD-NSGD
000000               OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SCN-CONTA-NSGD    OF SIDEC-CTA-NSGD
000000      TO SCN-CONTA-NSGD
000000               OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SCN-DIGITO-NSGD   OF SIDEC-CTA-NSGD
000000      TO SCN-DIGITO-NSGD
000000               OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SPACES TO SCN-TIPO-CONTA OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE ZEROS TO SCN-AG-DV OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE ZEROS TO SCN-CONTA OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE ZEROS TO SCN-DIGITO OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SCN-SEC-MIGRACAO  OF SIDEC-CTA-NSGD
000000      TO SCN-SEC-MIGRACAO
000000               OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SCN-ANO-MIGRACAO  OF SIDEC-CTA-NSGD
000000      TO SCN-ANO-MIGRACAO
000000               OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SCN-MES-MIGRACAO  OF SIDEC-CTA-NSGD
000000      TO SCN-MES-MIGRACAO
000000               OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SCN-DIA-MIGRACAO  OF SIDEC-CTA-NSGD
000000      TO SCN-DIA-MIGRACAO
000000               OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SCN-SEC-INCLUSAO  OF SIDEC-CTA-NSGD
000000      TO SCN-SEC-INCLUSAO
000000               OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SCN-ANO-INCLUSAO  OF SIDEC-CTA-NSGD
000000      TO SCN-ANO-INCLUSAO
000000               OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SCN-MES-INCLUSAO  OF SIDEC-CTA-NSGD
000000      TO SCN-MES-INCLUSAO
000000               OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SCN-DIA-INCLUSAO  OF SIDEC-CTA-NSGD
000000      TO SCN-DIA-INCLUSAO
000000               OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SCN-SIGLA-BANCO   OF SIDEC-CTA-NSGD
000000      TO SCN-SIGLA-BANCO
000000               OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    IF SCN-COD-TABELA    OF SIDEC-CTA-NSGD EQUAL 002
000000
000000          MOVE SCN-CHAVE-TAB OF SIDEC-CTA-NSGD
000000            TO SCN-CHAVE-TAB-WS
000000
000000          INITIALIZE SCN-CHAVE-TAB-WS-DOM
000000
000000          STRING SCN-CHAVE-TAB-WS(1:3)
000000               DELIMITED BY SIZE
000000               INTO SCN-CHAVE-TAB-WS-DOM
000000          END-STRING
000000
000000           MOVE SCN-CHAVE-TAB-WS-DOM
000000                TO SCN-PARTICIPANTE
000000                     OF SV-CONSULTAS-CMC(CONT-REG)
000000
000000          INITIALIZE SCN-CHAVE-TAB-WS-1
000000
000000          STRING SCN-CHAVE-TAB-WS(5:25)
000000               DELIMITED BY SIZE
000000               INTO SCN-CHAVE-TAB-WS-1
000000          END-STRING
000000
000000          MOVE SCN-CHAVE-TAB-WS-1
000000            TO SCN-CHAVE-TAB
000000                  OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    EVALUATE SCN-CHAVE-TAB-WS-DOM
000000        WHEN "MUT"
000000            MOVE "Mutuario" TO SCN-DET-PART
000000                            OF SV-CONSULTAS-CMC(CONT-REG)
000000        WHEN "CSV"
000000            MOVE "Conta Vinc.Mutuario" TO SCN-DET-PART
000000                            OF SV-CONSULTAS-CMC(CONT-REG)
000000        WHEN "VEC"
000000            MOVE "Vendedor" TO SCN-DET-PART
000000                            OF SV-CONSULTAS-CMC(CONT-REG)
000000        WHEN "UNO"
000000            MOVE "UNO" TO SCN-DET-PART
000000                            OF SV-CONSULTAS-CMC(CONT-REG)
000000        WHEN "CNV"
000000            MOVE "Convenio" TO SCN-DET-PART
000000                            OF SV-CONSULTAS-CMC(CONT-REG)
000000        WHEN "EMP"
000000            MOVE "Empresas" TO SCN-DET-PART
000000                            OF SV-CONSULTAS-CMC(CONT-REG)
000000        WHEN "AGE"
000000            MOVE "Agente(Prestador de Servico)"
000000               TO SCN-DET-PART
000000                            OF SV-CONSULTAS-CMC(CONT-REG)
000000        WHEN "EPR"
000000            MOVE "Empreendimento" TO SCN-DET-PART
000000                            OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    MOVE SCN-COD-TABELA    OF SIDEC-CTA-NSGD
000000      TO SCN-SITUACAO      OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000    EVALUATE SCN-SITUACAO OF SV-CONSULTAS-CMC(CONT-REG)
000000        WHEN 002
000000            MOVE "Conta migrada com sucesso"
000000                  TO SCN-DET-SITUAC
000000                        OF SV-CONSULTAS-CMC(CONT-REG)
000000        WHEN 003
000000            MOVE "Conta ja migrada"
000000                  TO SCN-DET-SITUAC
000000                        OF SV-CONSULTAS-CMC(CONT-REG)
000000        WHEN 004
000000            MOVE "Conta inexistente no SIACI"
000000                  TO SCN-DET-SITUAC
000000                        OF SV-CONSULTAS-CMC(CONT-REG)
000000        WHEN 005
000000            MOVE "Codigo da Operacao com restricao para migracao"
000000                  TO SCN-DET-SITUAC
000000                        OF SV-CONSULTAS-CMC(CONT-REG)
000000        WHEN 006
000000            MOVE "Codigo do Produto com restricao para migracao"
000000                  TO SCN-DET-SITUAC
000000                        OF SV-CONSULTAS-CMC(CONT-REG)
000000        WHEN 007
000000            MOVE "Codigo da Agencia invalido"
000000                  TO SCN-DET-SITUAC
000000                        OF SV-CONSULTAS-CMC(CONT-REG)
000000        WHEN 008
000000            MOVE "Conta nao migrada para contrato encerrado"
000000                  TO SCN-DET-SITUAC
000000                        OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000*    MOVE SCN-CHAVE-TAB     OF SIDEC-CTA-NSGD
000000*      TO SCN-CHAVE-TAB
000000*            OF SV-CONSULTAS-CMC(CONT-REG).
000000
000000 0200-FIM-MONTA-DETALHE.  EXIT.
000000
000000* 0300-RELATORIO.
000000
000000*     PERFORM 050-BUSCAR-CONTAS THRU 050-FIM-CONSULTA.
000000
000000
000000
000000
000000* 0300-FIM-RELATORIO.
000000* EXIT.
000000
000000
000000 FIM-PROGRAMA.
000000   EXIT.
000000