  IDENTIFICATION DIVISION.

 PROGRAM-ID.     S0947-FTE-902.

 AUTHOR.         D550134.

 INSTALLATION.   DATAMEC S.A. - BELO HORIZONTE - M.G.

 DATE-WRITTEN.

 DATE-COMPILED.


*----------------------------------------------------------------*
*                       RELATORIO MAC/MEX                        *
*----------------------------------------------------------------*

 ENVIRONMENT DIVISION.

 CONFIGURATION SECTION.

 SOURCE-COMPUTER.    A9.
 OBJECT-COMPUTER.    A9.
 SPECIAL-NAMES.      DECIMAL-POINT   IS  COMMA.

 INPUT-OUTPUT  SECTION.
 FILE-CONTROL.

     SELECT  ARQ-USU       ASSIGN  TO   DISK.
     SELECT  ARQ-GRP       ASSIGN  TO   DISK.
     SELECT  ARQ-PER       ASSIGN  TO   DISK.
     SELECT  ARQ-DESC-GRP  ASSIGN  TO   DISK.
     SELECT  ARQ-DESC-PER  ASSIGN  TO   DISK.

 DATA DIVISION.
 FILE SECTION.

 FD  ARQ-USU
     RECORD CONTAINS 356 CHARACTERS
     BLOCK  CONTAINS 180 RECORDS
     VALUE OF TITLE IS "S0947/TABLEAU/USU".

 01 USU-REG.
      03 CLI-JANELA                    PIC 9(04).
      03 USU-CODIGO                    PIC X(07).
      03 USU-NOME                      PIC X(30).
      03 UNO-CODIGO                    PIC 9(05).
      03 LOT-CODIGO                    PIC 9(04).
      03 TIF-CODIGO                    PIC 9(04).
      03 UNO-CODIGO-FIS                PIC 9(05).
      03 LOT-CODIGO-FIS                PIC 9(04).
      03 TIF-CODIGO-FIS                PIC 9(04).
      03 UNO-CODIGO-SUB                PIC 9(05).
      03 LOT-CODIGO-SUB                PIC 9(04).
      03 TIF-CODIGO-SUB                PIC 9(04).
      03 USU-COD-CORRESP               PIC 9(08).
      03 USU-NVL-ACE                   PIC 9(01).

**--------GRUPOS-------**
 FD  ARQ-GRP
     RECORD CONTAINS 356 CHARACTERS
     BLOCK  CONTAINS 180 RECORDS
     VALUE OF TITLE IS "S0947/TABLEAU/GRP".

 01 GRP-REG.
      03 CLI-JANELA                    PIC 9(04).
      03 USU-CODIGO-GRP                PIC X(07).
      03 GOP-CODIGO-GRP                PIC 9(04).
      03 SIS-CODIGO                    PIC 9(04).
      03 SIS-NOME                      PIC X(50).
      03 UCS-ABRANGENCIA               PIC 9(04).
      03 ABR-DESCRICAO                 PIC X(40).

**--------PERFIS-------**
 FD  ARQ-PER
     RECORD CONTAINS 356 CHARACTERS
     BLOCK  CONTAINS 180 RECORDS
     VALUE OF TITLE IS "S0947/TABLEAU/PER".

 01 PER-REG.
      03 CLI-JANELA                    PIC 9(04).
      03 USU-CODIGO-PER                PIC X(07).
      03 SIS-CODIGO-PER                PIC 9(04).
*     03 PER-DESCRICACAO               PIC X(50).
      03 SIS-CODIGO                    PIC 9(04).
      03 SIS-NOME                      PIC X(50).

**-------DESCRICAO GRUPO-------**
 FD  ARQ-DESC-GRP
     RECORD CONTAINS 356 CHARACTERS
     BLOCK  CONTAINS 180 RECORDS
     VALUE OF TITLE IS "S0947/TABLEAU/DESCGRP".

 01 DESC-GRP-REG.
     03 CLI-JANELA                    PIC 9(04).
     03 SIS-CODIGO-GRP                PIC 9(04).
     03 GOP-MNEMONICO                 PIC X(10).
     03 GOP-DESCRICAO                 PIC X(50).

**-------DESCRICAO PERFIL-------**
 FD  ARQ-DESC-PER
     RECORD CONTAINS 356 CHARACTERS
     BLOCK  CONTAINS 180 RECORDS
     VALUE OF TITLE IS "S0947/TABLEAU/DESCPER".

 01 DESC-PER-REG.
     03 CLI-JANELA                    PIC 9(04).
     03 SIS-CODIGO-PER                PIC 9(04).
     03 PER-DESCRICAO                 PIC X(50).


 DATA-BASE SECTION.

 DB  BDSEGURANCA OF  BDDATAMEC ALL.

 WORKING-STORAGE SECTION.

 77  RESULTADO-77                PIC S9(11)  BINARY EXTENDED.
 77  PROGRAMA-DESIGNATOR-77      REAL.
 77  AGENDA-INPUT-77             REAL.
 77  AGENDA-DESTINO-77           REAL.
 77  WINDOW-DESIGNATOR-77        REAL.
 77  ESTACAO-REAL-77             REAL.
 77  STATION-DESIG-77            PIC S9(11)  BINARY.
 77  STATION-DEVICE-77           PIC S9(11)  BINARY.
 77  STATION-LSN-77              PIC S9(11)  BINARY.
 77  STATION-SEC-77              PIC S9(11)  BINARY.
 77  IND-SEC-GLOBAL-77           PIC 9(02).
 77  CODIGO-INFORMACAO-77        PIC S9(11) BINARY EXTENDED.
 77  ENVIA-TELA-77               PIC S9(11)  BINARY EXTENDED.

 77  WS-LIDOS                              PIC 9(06).
 77  WS-GRAVADOS                           PIC 9(06).

 01 VARIAVEIS.
   02 FCO-COD-ORI-WS               PIC 9(04).
   02 FCO-COD-FIS-WS               PIC 9(04).
   02 FCO-COD-SUB-WS               PIC 9(04).
   02 CLI-JANELA-WS                PIC 9(04).
   02 SIS-CODIGO-WS                PIC 9(04).
*   02 GOP-CODIGO-WS                PIC 9(04).
   02 PER-CODIGO-WS                PIC 9(04).
   02 VERSAO-SEG-WS                PIC 9(01).

   02 DATA-ACCEPT            PIC 9(06)     COMP.
   02 DATA-ACCEPTR REDEFINES DATA-ACCEPT   COMP.
      03 ANO-ACCEPT          PIC 9(02)     COMP.
      03 MES-ACCEPT          PIC 9(02)     COMP.
      03 DIA-ACCEPT          PIC 9(02)     COMP.

   02 DATA-SISTEMA           PIC 9(08)      COMP.
   02 DATA-SISTEMAR  REDEFINES DATA-SISTEMA COMP.
      03 SEC-SISTEMA         PIC 9(02)      COMP.
      03 ANO-SISTEMA         PIC 9(02)      COMP.
      03 MES-SISTEMA         PIC 9(02)      COMP.
      03 DIA-SISTEMA         PIC 9(02)      COMP.

******************************************************************
*                                                                *
*              CORPO PRINCIPAL DO PROGRAMA                       *
*                                                                *
******************************************************************

 PROCEDURE DIVISION.

 0001-00-INICIO-PROGRAMA.

     ACCEPT DATA-ACCEPT FROM DATE.
     MOVE DIA-ACCEPT TO DIA-SISTEMA.
     MOVE MES-ACCEPT TO MES-SISTEMA.
     MOVE ANO-ACCEPT TO ANO-SISTEMA.
     MOVE 20         TO SEC-SISTEMA.

     MOVE 102 TO CLI-JANELA-WS.

 0100-INICIO-PROC-SISEG-TABLEAU.

     OPEN OUTPUT ARQ-USU.

     PERFORM 0200-IDENTIFICA-USU
        THRU 0200-IDENTIFICA-USU-FIM.

     CLOSE ARQ-USU SAVE.

*     PERFORM 0500-ARQUIVO-GRUPOS
*        THRU 0500-ARQUIVO-GRUPOS-FIM.

*     PERFORM 0600-ARQUIVO-PERFIL
*        THRU 0600-ARQUIVO-PERFIL-FIM.

 0100-FIM-PROC-SISEG-TABLEAU.

 0200-IDENTIFICA-USU.

     SET USU-POR-IDENT TO BEGINNING.

 PROCESSA-USU.

     FIND NEXT USU-POR-IDENT
       ON EXCEPTION
          IF DMSTATUS(NOTFOUND)
             GO TO 0200-IDENTIFICA-USU-FIM
          ELSE
             CALL SYSTEM DMTERMINATE
          END-IF
     END-FIND

     MOVE USU-CODIGO OF USUARIOS TO USU-CODIGO OF USU-REG.
     MOVE USU-CODIGO OF USUARIOS TO USU-CODIGO-GRP OF ARQ-GRP.
     MOVE USU-CODIGO OF USUARIOS TO USU-CODIGO-PER OF ARQ-PER.

     PERFORM 0210-MONTA-USU THRU 0210-MONTA-USU-FIM.

     PERFORM 0220-BUSCA-TIPO-LOTACAO
                            THRU 0220-BUSCA-TIPO-LOTACAO-FIM.
     PERFORM 0230-BUSCA-TIF-CODIGO
                            THRU 0230-BUSCA-TIF-CODIGO-FIM.
     PERFORM 0240-BUSCA-NIVEL-ACESSO
                            THRU 0240-BUSCAO-NIVEL-ACESSO-FIM.
     PERFORM 0290-MONTA-USU-REG
                            THRU 0290-MONTA-DETALHE-USU-FIM.

     GO TO PROCESSA-USU.

 0200-IDENTIFICA-USU-FIM.

 0210-MONTA-USU.

       FIND USC-POR-USUARIO AT
          CLI-CODIGO = CLI-JANELA-WS AND
          USU-CODIGO = USU-CODIGO OF USU-REG
          ON EXCEPTION
              IF DMSTATUS(NOTFOUND)
                 DISPLAY "Usuario nao possui MAC."
              ELSE
                 CALL SYSTEM DMTERMINATE
              END-IF
       END-FIND.

       IF UNO-CODIGO-ORI OF USUARIO-CLI NOT EQUAL ZEROS THEN
           MOVE UNO-CODIGO-ORI OF USUARIO-CLI
                               TO UNO-CODIGO OF USU-REG
       END-IF

       IF UNO-CODIGO-FIS OF USUARIO-CLI NOT EQUAL ZEROS THEN
           MOVE UNO-CODIGO-FIS OF USUARIO-CLI
                               TO UNO-CODIGO-FIS OF USU-REG
       END-IF

       IF UNO-CODIGO-SUB OF USUARIO-CLI NOT EQUAL ZEROS AND
           DATA-SISTEMAR >= USC-DATA-INI-SUBST OF USUARIO-CLI AND
           DATA-SISTEMAR <= USC-DATA-FIM-SUBST OF USUARIO-CLI THEN
               MOVE UNO-CODIGO-SUB OF USUARIO-CLI
                            TO UNO-CODIGO-SUB OF USU-REG
       END-IF.

 0210-MONTA-USU-FIM.

 0220-BUSCA-TIPO-LOTACAO.

**PROCURA LOT-CODIGO ORI
   FIND UNL-POR-UNO AT
         CLI-CODIGO = CLI-JANELA-WS AND
         UNO-CODIGO = UNO-CODIGO-FIS OF USU-REG
         ON EXCEPTION
            IF NOT DMSTATUS (NOTFOUND) THEN
               CALL SYSTEM DMTERMINATE
            ELSE
               DISPLAY "Tipo de Lotacao nao cadastrada."
            END-IF
            GO TO 0220-BUSCA-TIPO-LOTACAO-FIM
    END-FIND.

    MOVE LOT-CODIGO OF UNO-LOTACAO
      TO LOT-CODIGO OF USU-REG.
**PROCURA LOT-CODIGO ORI

**PROCURA LOT-CODIGO FIS
       IF UNO-CODIGO-FIS OF USUARIO-CLI NOT EQUAL ZEROS THEN
           FIND UNL-POR-UNO AT
               CLI-CODIGO = CLI-JANELA-WS AND
               UNO-CODIGO = UNO-CODIGO-FIS OF USU-REG
           ON EXCEPTION
               IF NOT DMSTATUS (NOTFOUND) THEN
                  CALL SYSTEM DMTERMINATE
               ELSE
                   DISPLAY "Tipo de Lotacao nao cadastrada."
               END-IF
               GO TO 0220-BUSCA-TIPO-LOTACAO-FIM
           END-FIND
       END-IF.

      MOVE LOT-CODIGO OF UNO-LOTACAO
           TO LOT-CODIGO-FIS OF USU-REG.

**PROCURA LOT-CODIGO FIS

**PROCURA LOT-CODIGO SUB
   FIND UNL-POR-UNO AT
         CLI-CODIGO = CLI-JANELA-WS AND
         UNO-CODIGO = UNO-CODIGO-FIS OF USU-REG
         ON EXCEPTION
            IF NOT DMSTATUS (NOTFOUND) THEN
               CALL SYSTEM DMTERMINATE
            ELSE
               DISPLAY "Tipo de Lotacao nao cadastrada."
            END-IF
            GO TO 0220-BUSCA-TIPO-LOTACAO-FIM
    END-FIND.

    MOVE LOT-CODIGO OF UNO-LOTACAO
      TO LOT-CODIGO-SUB OF USU-REG.

**PROCURA LOT-CODIGO SUB

 0220-BUSCA-TIPO-LOTACAO-FIM.
 EXIT.

 0230-BUSCA-TIF-CODIGO.
**buscar na funcionarios o fco codigo e procurar
**FUN-CLIENTE
**FUN-CODIGO A
    FIND FUN-POR-IDENT
       AT FUN-CLIENTE = CLI-JANELA-WS
       AND FUN-CODIGO = USU-CODIGO OF USU-REG
       ON EXCEPTION
         IF DMSTATUS(NOTFOUND)
         DISPLAY "EXIBIR MENSAGEM DE ERRO"
         ELSE
            CALL SYSTEM DMTERMINATE
    END-FIND.

    IF FCO-CODIGO-ORI OF FUNCIONARIOS NOT EQUAL ZEROS
           MOVE FCO-CODIGO-ORI OF FUNCIONARIOS
                   TO FCO-COD-ORI-WS.

    IF FCO-CODIGO-FIS OF FUNCIONARIOS NOT EQUAL ZEROS
           MOVE FCO-CODIGO-FIS OF FUNCIONARIOS
                   TO FCO-COD-FIS-WS.

    IF FCO-CODIGO-SUB OF FUNCIONARIOS NOT EQUAL ZEROS
           MOVE FCO-CODIGO-SUB OF FUNCIONARIOS
                   TO FCO-COD-SUB-WS.
**BUSCA TIF-CODIGO ORI
    FIND FIRST FCO-POR-CODIGO AT
           CLI-CODIGO   =  CLI-JANELA-WS AND
           FCO-CODIGO   =  FCO-COD-ORI-WS
           ON EXCEPTION
              IF DMSTATUS (NOTFOUND)
                 DISPLAY "Tipo de Funcao nao cadastrada."
                 MOVE 1 TO RESULTADO-77
              ELSE
                 CALL SYSTEM DMTERMINATE
              END-IF
              GO TO 0230-BUSCA-TIF-CODIGO-FIM
    END-FIND.

    MOVE TIF-CODIGO OF FUNCAO
      TO TIF-CODIGO OF USU-REG.
**BUSCA TIF-CODIGO ORI
**BUSCA TIF-CODIGO FIS
    FIND FIRST FCO-POR-CODIGO AT
           CLI-CODIGO   =  CLI-JANELA-WS AND
           FCO-CODIGO   =  FCO-COD-ORI-WS
           ON EXCEPTION
              IF DMSTATUS (NOTFOUND)
                 DISPLAY "Tipo de Funcao nao cadastrada."
                 MOVE 1 TO RESULTADO-77
              ELSE
                 CALL SYSTEM DMTERMINATE
              END-IF
              GO TO 0230-BUSCA-TIF-CODIGO-FIM
    END-FIND.

    MOVE TIF-CODIGO OF FUNCAO
      TO TIF-CODIGO OF USU-REG.
**BUSCA TIF-CODIGO FIS
**BUSCA TIF-CODIGO SUB
    FIND FIRST FCO-POR-CODIGO AT
           CLI-CODIGO   =  CLI-JANELA-WS AND
           FCO-CODIGO   =  FCO-COD-ORI-WS
           ON EXCEPTION
              IF DMSTATUS (NOTFOUND)
                 DISPLAY "Tipo de Funcao nao cadastrada."
                 MOVE 1 TO RESULTADO-77
              ELSE
                 CALL SYSTEM DMTERMINATE
              END-IF
              GO TO 0230-BUSCA-TIF-CODIGO-FIM
    END-FIND.

    MOVE TIF-CODIGO OF FUNCAO
      TO TIF-CODIGO OF USU-REG.
**BUSCA TIF-CODIGO SUB

 0230-BUSCA-TIF-CODIGO-FIM.
 EXIT.

 0240-BUSCA-NIVEL-ACESSO.

   FIND UCS-POR-USUARIO AT
         CFS-VER-SISEG = 0                AND
         USU-CLIENTE = CLI-JANELA-WS      AND
         USU-CODIGO = USU-CODIGO OF USU-REG
         ON EXCEPTION
            IF DMSTATUS(NOTFOUND)
               DISPLAY "Sem nivel de acesso"
            END-IF
   END-FIND.

   MOVE UCS-FUNCAO OF USUARIOS-CLI-SIST TO
         USU-NVL-ACE OF USU-REG.

 0240-BUSCAO-NIVEL-ACESSO-FIM.

 0290-MONTA-USU-REG.

       MOVE USU-CODIGO     OF USUARIO-CLI
                           TO USU-CODIGO OF USU-REG.
       MOVE USU-NOME       OF USUARIOS
                           TO USU-NOME   OF USU-REG.
       MOVE UNO-CODIGO-ORI OF USUARIO-CLI
                           TO UNO-CODIGO OF USU-REG.
       MOVE UNO-CODIGO-FIS OF USUARIO-CLI
                           TO UNO-CODIGO-FIS OF USU-REG.
       MOVE UNO-CODIGO-SUB OF USUARIO-CLI
                           TO UNO-CODIGO-SUB OF USU-REG.

 WRITE USU-REG.

 0290-MONTA-DETALHE-USU-FIM.
 EXIT.

 0300-PROCESSA-GRUPOS.
* PROCURAR MATRIZ PELA LOTACAO
    SET MGR-POR-LOTAC TO BEGINNING.

 0310-MONTA-COD-GRUPO.
    FIND KEY OF NEXT MGR-POR-LOTAC AT
         CLI-CODIGO = CLI-JANELA-WS AND
         LOT-CODIGO = LOT-CODIGO  OF USU-REG    AND
         TIF-CODIGO = TIF-CODIGO  OF USU-REG
         ON EXCEPTION
            IF NOT DMSTATUS(NOTFOUND)
               DISPLAY "MENSAGEM DE ERRO"
            ELSE
               DISPLAY "Usuario nao possui matriz de acesso."
            END-IF
    END-FIND.

    MOVE GOP-CODIGO OF MATRIZ-GRUPO TO GOP-CODIGO-GRP OF ARQ-GRP.
    MOVE SIS-CODIGO OF MATRIZ-GRUPO TO SIS-CODIGO OF ARQ-GRP.

 0310-MONTA-COD-GRUPO-FIM.
 EXIT.

 0320-MONTA-NOME-SISTEMA.
   SET SIS-POR-CODIGO TO BEGINNING.
   MOVE SPACES TO SIS-NOME OF ARQ-GRP.

 0330-BUSCA-SISTEMA.
   FIND NEXT SIS-POR-CODIGO AT
         SIS-CODIGO = SIS-CODIGO OF ARQ-GRP
          ON EXCEPTION
             IF DMSTATUS(NOTFOUND)
                DISPLAY "Sistema nao cadastrado."
             ELSE
                DISPLAY "MENSAGEM ERRO"
             END-IF
   END-FIND.

   MOVE SIS-NOME OF SISTEMAS
     TO SIS-NOME OF ARQ-GRP.

 0320-MONTA-NOME-SISTEMA-FIM.
 EXIT.

 0330-MONTA-ABRANGENCIA.

     FIND MAB-POR-LOT-TIF AT
           CLI-CODIGO   = CLI-JANELA-WS AND
           SIS-CODIGO   = SIS-CODIGO OF SISTEMAS    AND
           LOT-CODIGO   = LOT-CODIGO OF USU-REG     AND
           TIF-CODIGO   = TIF-CODIGO OF USU-REG
           ON EXCEPTION
              IF NOT DMSTATUS (NOTFOUND)
                  DISPLAY "MENSAGEM ERRO"
              END-IF
     END-FIND.

     MOVE UCS-ABRANGENCIA OF MATRIZ-ABRANG
       TO UCS-ABRANGENCIA OF ARQ-GRP.

     FIND FIRST TAG-POR-IDENT AT
          TAG-CLIENTE  =  CLI-JANELA-WS         AND
          TAG-SISTEMA  =  SIS-CODIGO OF ARQ-GRP AND
          TAG-CODIGO   =  UCS-ABRANGENCIA OF ARQ-GRP
           ON EXCEPTION
              IF DMSTATUS (NOTFOUND)
                 DISPLAY "Codigo abrangencia nao cadastrado"
              ELSE
                 DISPLAY "MENSAGEM ERRO"
              END-IF
     END-FIND.

    MOVE TAG-DESCRICAO   OF TAB-ABRANGENCIA
      TO ABR-DESCRICAO   OF ARQ-GRP.

 0330-MONTA-ABRANGENCIA-FIM.
   EXIT.

 0300-PROCESSA-GRUPOS-FIM.
     EXIT.

 0400-PROCESSA-PERFIL.

    SET SIS-POR-CODIGO TO BEGINNING.

 0401-MONTA-MATRIZ-PERFIL.
    FIND KEY OF NEXT MPE-POR-LOT-TIF AT
         CLI-CODIGO = CLI-JANELA-WS AND
         LOT-CODIGO = LOT-CODIGO  OF USU-REG    AND
         TIF-CODIGO = TIF-CODIGO  OF USU-REG
         ON EXCEPTION
            IF NOT DMSTATUS(NOTFOUND)
               DISPLAY "ERRO BANCO DE DADOS"
            END-IF
    END-FIND.

    MOVE PER-CODIGO OF MATRIZ-PERFIL TO SIS-CODIGO-PER OF ARQ-PER.
    MOVE SIS-CODIGO OF MATRIZ-PERFIL TO SIS-CODIGO OF ARQ-PER.

 0420-BUSCA-SISTEMA.
   FIND NEXT SIS-POR-CODIGO AT
         SIS-CODIGO = SIS-CODIGO OF ARQ-PER
          ON EXCEPTION
             IF DMSTATUS(NOTFOUND)
                DISPLAY "Sistema nao cadastrado."
                  ELSE
                DISPLAY "MENSAGEM ERRO"
             END-IF
   END-FIND.

   MOVE SIS-NOME OF SISTEMAS
     TO SIS-NOME OF ARQ-PER.

 0420-MONTA-NOME-SISTEMA-FIM.
  EXIT.

 0400-PROCESSA-PERFIL-FIM.
 EXIT.

 0500-ARQUIVO-GRUPOS.

   SET GOP-POR-IDENT TO BEGINNING.

   FIND FIRST GOP-POR-IDENT AT
          CFS-VER-SISEG = VERSAO-SEG-WS     AND
          GOP-CLIENTE   = CLI-JANELA-WS
          ON EXCEPTION
             IF DMSTATUS (NOTFOUND)
                  DISPLAY "Grupo nao identificado"
                  GO TO 0500-ARQUIVO-GRUPOS-FIM
             END-IF
    END-FIND.


   MOVE GOP-CLIENTE OF GRUPOS-OPERACOES
                     TO CLI-JANELA OF ARQ-DESC-GRP.
   MOVE GOP-CODIGO OF GRUPOS-OPERACOES
                     TO SIS-CODIGO-GRP OF ARQ-DESC-GRP.
   MOVE GOP-MNEMONICO OF GRUPOS-OPERACOES
                        TO GOP-MNEMONICO OF ARQ-DESC-GRP.
   MOVE GOP-DESCRICAO OF GRUPOS-OPERACOES
                        TO GOP-DESCRICAO OF ARQ-DESC-GRP.

   GO TO NEXT-GRUPO.

 NEXT-GRUPO.

   FIND FIRST GOP-POR-IDENT AT
          CFS-VER-SISEG = VERSAO-SEG-WS     AND
          GOP-CLIENTE   = CLI-JANELA-WS
          ON EXCEPTION
             IF DMSTATUS (NOTFOUND)
             IF DMSTATUS (NOTFOUND)
                  DISPLAY "Grupo nao identificado"
                  GO TO 0500-ARQUIVO-GRUPOS-FIM
             END-IF
    END-FIND.

   MOVE GOP-CLIENTE OF GRUPOS-OPERACOES
                     TO CLI-JANELA OF ARQ-DESC-GRP.
   MOVE GOP-CODIGO OF GRUPOS-OPERACOES
                     TO SIS-CODIGO-GRP OF ARQ-DESC-GRP.
   MOVE GOP-MNEMONICO OF GRUPOS-OPERACOES
                        TO GOP-MNEMONICO OF ARQ-DESC-GRP.
   MOVE GOP-DESCRICAO OF GRUPOS-OPERACOES
                        TO GOP-DESCRICAO OF ARQ-DESC-GRP.

 0500-ARQUIVO-GRUPOS-FIM.
 EXIT.

 0600-ARQUIVO-PERFIL.

      SET PER-POR-IDENT TO BEGINNING.
      SET MPE-POR-LOT-TIF TO BEGINNING.

      FIND FIRST MPE-POR-LOT-TIF AT
          CLI-CODIGO = CLI-JANELA-WS
          ON EXCEPTION
            IF DMSTATUS (NOTFOUND)
               DISPLAY "Nenhum perfil encontrado"
               GO TO 0600-ARQUIVO-PERFIL-FIM
            END-IF
      END-FIND.

      MOVE SIS-CODIGO OF MATRIZ-PERFIL TO SIS-CODIGO-WS.
      MOVE PER-CODIGO OF MATRIZ-PERFIL TO PER-CODIGO-WS.

      FIND FIRST PER-POR-IDENT AT
          SIS-CODIGO = SIS-CODIGO-WS AND
          PER-CODIGO = PER-CODIGO-WS
          ON EXCEPTION
             IF DMSTATUS (NOTFOUND)
               DISPLAY "Nenhum perfil encontrado"
               GO TO 0600-ARQUIVO-PERFIL-FIM
             END-IF
     END-FIND.

     MOVE CLI-JANELA-WS TO CLI-JANELA OF ARQ-DESC-PER.
     MOVE PER-CODIGO OF PERFIL TO SIS-CODIGO-PER OF ARQ-DESC-PER.
     MOVE PER-DESCRICAO OF PERFIL
                           TO PER-DESCRICAO OF ARQ-DESC-PER.

     GO TO NEXT-PERFIL.

 NEXT-PERFIL.

     FIND FIRST MPE-POR-LOT-TIF AT
          CLI-CODIGO = CLI-JANELA-WS
          ON EXCEPTION
            IF DMSTATUS (NOTFOUND)
               DISPLAY "Nenhum perfil encontrado"
               GO TO 0600-ARQUIVO-PERFIL-FIM
            END-IF
     END-FIND.

     MOVE SIS-CODIGO OF MATRIZ-PERFIL TO SIS-CODIGO-WS.
     MOVE PER-CODIGO OF MATRIZ-PERFIL TO PER-CODIGO-WS.

     FIND FIRST PER-POR-IDENT AT
          SIS-CODIGO = SIS-CODIGO-WS AND
          PER-CODIGO = PER-CODIGO-WS
         ON EXCEPTION
             IF DMSTATUS (NOTFOUND)
                DISPLAY "Nenhum perfil encontrado"
                GO TO 0600-ARQUIVO-PERFIL-FIM
             END-IF
     END-FIND.

     MOVE CLI-JANELA-WS TO CLI-JANELA OF ARQ-DESC-PER.
     MOVE PER-CODIGO OF PERFIL TO SIS-CODIGO-PER OF ARQ-DESC-PER.
     MOVE PER-DESCRICAO OF PERFIL
                           TO PER-DESCRICAO OF ARQ-DESC-PER.

  0600-ARQUIVO-PERFIL-FIM.
  EXIT.

  99900-00-ULTIMO-PARAGRAFO.
      CLOSE BDSEGURANCA.
      STOP RUN.

  END-OF-JOB.
