000000 IDENTIFICATION DIVISION.
000000
000000 PROGRAM-ID.     S0947-FTE-902.
000000 
000000 AUTHOR.         D550134.
000000 
000000 INSTALLATION.   DATAMEC S.A. - BELO HORIZONTE - M.G.
000000 
000000 DATE-WRITTEN.
000000 
000000 DATE-COMPILED.
000000 
000000 
000000 ----------------------------------------------------------------*
000000                        RELATORIO MAC/MEX                        *
000000 ----------------------------------------------------------------*
000000 
000000 ENVIRONMENT DIVISION.
000000 
000000 CONFIGURATION SECTION.
000000 
000000 SOURCE-COMPUTER.    A9.
000000 OBJECT-COMPUTER.    A9.
000000 SPECIAL-NAMES.      DECIMAL-POINT   IS  COMMA.
000000 
000000 INPUT-OUTPUT  SECTION.
000000 FILE-CONTROL.
000000 
000000     SELECT  ARQ-USU       ASSIGN  TO   DISK.
000000     SELECT  ARQ-GRP       ASSIGN  TO   DISK.
000000     SELECT  ARQ-PER       ASSIGN  TO   DISK.
000000     SELECT  ARQ-DESC-GRP  ASSIGN  TO   DISK.
000000     SELECT  ARQ-DESC-PER  ASSIGN  TO   DISK.
000000 
000000 DATA DIVISION.
000000 FILE SECTION.
000000 
000000 FD  ARQ-USU
000000     RECORD CONTAINS 356 CHARACTERS
000000     BLOCK  CONTAINS 180 RECORDS
000000     VALUE OF TITLE IS "S0947/TABLEAU/USU".
000000 
000000 01 USU-REG.
000000      03 CLI-JANELA                    PIC 9(04).
000000      03 USU-CODIGO                    PIC X(07).
000000      03 USU-NOME                      PIC X(30).
000000      03 UNO-CODIGO                    PIC 9(05).
000000      03 LOT-CODIGO                    PIC 9(04).
000000      03 TIF-CODIGO                    PIC 9(04).
000000      03 UNO-CODIGO-FIS                PIC 9(05).
000000      03 LOT-CODIGO-FIS                PIC 9(04).
000000      03 TIF-CODIGO-FIS                PIC 9(04).
000000      03 UNO-CODIGO-SUB                PIC 9(05).
000000      03 LOT-CODIGO-SUB                PIC 9(04).
000000      03 TIF-CODIGO-SUB                PIC 9(04).
000000      03 USU-COD-CORRESP               PIC 9(08).
000000      03 USU-NVL-ACE                   PIC 9(01).
000000 
000000 *--------GRUPOS-------**
000000 FD  ARQ-GRP
000000     RECORD CONTAINS 356 CHARACTERS
000000     BLOCK  CONTAINS 180 RECORDS
000000     VALUE OF TITLE IS "S0947/TABLEAU/GRP".
000000 
000000 01 GRP-REG.
000000      03 CLI-JANELA                    PIC 9(04).
000000      03 USU-CODIGO-GRP                PIC X(07).
000000      03 GOP-CODIGO-GRP                PIC 9(04).
000000      03 SIS-CODIGO                    PIC 9(04).
000000      03 SIS-NOME                      PIC X(50).
000000      03 UCS-ABRANGENCIA               PIC 9(04).
000000      03 ABR-DESCRICAO                 PIC X(40).
000000 
000000 *--------PERFIS-------**
000000 FD  ARQ-PER
000000     RECORD CONTAINS 356 CHARACTERS
000000     BLOCK  CONTAINS 180 RECORDS
000000     VALUE OF TITLE IS "S0947/TABLEAU/PER".
000000 
000000 01 PER-REG.
000000      03 CLI-JANELA                    PIC 9(04).
000000      03 USU-CODIGO-PER                PIC X(07).
000000      03 SIS-CODIGO-PER                PIC 9(04).
000000      03 PER-DESCRICACAO               PIC X(50).
000000      03 SIS-CODIGO                    PIC 9(04).
000000      03 SIS-NOME                      PIC X(50).
000000 
000000 *-------DESCRICAO GRUPO-------**
000000 FD  ARQ-DESC-GRP
000000     RECORD CONTAINS 356 CHARACTERS
000000     BLOCK  CONTAINS 180 RECORDS
000000     VALUE OF TITLE IS "S0947/TABLEAU/DESCGRP".
000000 
000000 01 DESC-GRP-REG.
000000     03 CLI-JANELA                    PIC 9(04).
000000     03 SIS-CODIGO-GRP                PIC 9(04).
000000     03 GOP-MNEMONICO                 PIC X(10).
000000     03 GOP-DESCRICAO                 PIC X(50).
000000 
000000 *-------DESCRICAO PERFIL-------**
000000 FD  ARQ-DESC-PER
000000     RECORD CONTAINS 356 CHARACTERS
000000     BLOCK  CONTAINS 180 RECORDS
000000     VALUE OF TITLE IS "S0947/TABLEAU/DESCPER".
000000 
000000 01 DESC-PER-REG.
000000     03 CLI-JANELA                    PIC 9(04).
000000     03 SIS-CODIGO-PER                PIC 9(04).
000000     03 PER-DESCRICAO                 PIC X(50).
000000 
000000 
000000 DATA-BASE SECTION.
000000 
000000 DB  BDSEGURANCA OF  BDDATAMEC ALL.
000000 
000000 WORKING-STORAGE SECTION.
000000 
000000 77  RESULTADO-77                PIC S9(11)  BINARY EXTENDED.
000000 77  PROGRAMA-DESIGNATOR-77      REAL.
000000 77  AGENDA-INPUT-77             REAL.
000000 77  AGENDA-DESTINO-77           REAL.
000000 77  WINDOW-DESIGNATOR-77        REAL.
000000 77  ESTACAO-REAL-77             REAL.
000000 77  STATION-DESIG-77            PIC S9(11)  BINARY.
000000 77  STATION-DEVICE-77           PIC S9(11)  BINARY.
000000 77  STATION-LSN-77              PIC S9(11)  BINARY.
000000 77  STATION-SEC-77              PIC S9(11)  BINARY.
000000 77  IND-SEC-GLOBAL-77           PIC 9(02).
000000 77  CODIGO-INFORMACAO-77        PIC S9(11) BINARY EXTENDED.
000000 77  ENVIA-TELA-77               PIC S9(11)  BINARY EXTENDED.
000000 
000000 77  WS-LIDOS                              PIC 9(06).
000000 77  WS-GRAVADOS                           PIC 9(06).
000000 
000000 01 VARIAVEIS.
000000   02 FCO-COD-ORI-WS               PIC 9(04).
000000   02 FCO-COD-FIS-WS               PIC 9(04).
000000   02 FCO-COD-SUB-WS               PIC 9(04).
000000   02 CLI-JANELA-WS                PIC 9(04).
000000   02 SIS-CODIGO-WS                PIC 9(04).
000000    02 GOP-CODIGO-WS                PIC 9(04).
000000   02 PER-CODIGO-WS                PIC 9(04).
000000   02 VERSAO-SEG-WS                PIC 9(01).
000000 
000000   02 DATA-ACCEPT            PIC 9(06)     COMP.
000000   02 DATA-ACCEPTR REDEFINES DATA-ACCEPT   COMP.
000000      03 ANO-ACCEPT          PIC 9(02)     COMP.
000000      03 MES-ACCEPT          PIC 9(02)     COMP.
000000      03 DIA-ACCEPT          PIC 9(02)     COMP.
000000 
000000   02 DATA-SISTEMA           PIC 9(08)      COMP.
000000   02 DATA-SISTEMAR  REDEFINES DATA-SISTEMA COMP.
000000      03 SEC-SISTEMA         PIC 9(02)      COMP.
000000      03 ANO-SISTEMA         PIC 9(02)      COMP.
000000      03 MES-SISTEMA         PIC 9(02)      COMP.
000000      03 DIA-SISTEMA         PIC 9(02)      COMP.
000000 
000000*****************************************************************
000000*                                                               *
000000*             CORPO PRINCIPAL DO PROGRAMA                       *
000000*                                                               *
000000*****************************************************************
000000
000000 PROCEDURE DIVISION.
000000
000000 0001-00-INICIO-PROGRAMA.
000000
000000    ACCEPT DATA-ACCEPT FROM DATE.
000000    MOVE DIA-ACCEPT TO DIA-SISTEMA.
000000    MOVE MES-ACCEPT TO MES-SISTEMA.
000000    MOVE ANO-ACCEPT TO ANO-SISTEMA.
000000    MOVE 20         TO SEC-SISTEMA.
000000
000000    MOVE 102 TO CLI-JANELA-WS.
000000
000000 0100-INICIO-PROC-SISEG-TABLEAU.
000000
000000    OPEN OUTPUT ARQ-USU.
000000
000000    PERFORM 0200-IDENTIFICA-USU
000000       THRU 0200-IDENTIFICA-USU-FIM.
000000
000000    CLOSE ARQ-USU SAVE.
000000
000000     PERFORM 0500-ARQUIVO-GRUPOS
000000        THRU 0500-ARQUIVO-GRUPOS-FIM.
000000
000000     PERFORM 0600-ARQUIVO-PERFIL
000000        THRU 0600-ARQUIVO-PERFIL-FIM.
000000
000000 0100-FIM-PROC-SISEG-TABLEAU.
000000
000000 0200-IDENTIFICA-USU.
000000
000000    SET USU-POR-IDENT TO BEGINNING.
000000
000000 PROCESSA-USU.
000000
000000    FIND NEXT USU-POR-IDENT
000000      ON EXCEPTION
000000         IF DMSTATUS(NOTFOUND)
000000            GO TO 0200-IDENTIFICA-USU-FIM
000000         ELSE
000000            CALL SYSTEM DMTERMINATE
000000         END-IF
000000    END-FIND
000000
000000    MOVE USU-CODIGO OF USUARIOS TO USU-CODIGO OF USU-REG.
000000    MOVE USU-CODIGO OF USUARIOS TO USU-CODIGO-GRP OF ARQ-GRP.
000000    MOVE USU-CODIGO OF USUARIOS TO USU-CODIGO-PER OF ARQ-PER.
000000
000000    PERFORM 0210-MONTA-USU THRU 0210-MONTA-USU-FIM.
000000
000000    PERFORM 0220-BUSCA-TIPO-LOTACAO
000000                           THRU 0220-BUSCA-TIPO-LOTACAO-FIM.
000000    PERFORM 0230-BUSCA-TIF-CODIGO
000000                           THRU 0230-BUSCA-TIF-CODIGO-FIM.
000000    PERFORM 0240-BUSCA-NIVEL-ACESSO
000000                           THRU 0240-BUSCAO-NIVEL-ACESSO-FIM.
000000    PERFORM 0290-MONTA-USU-REG
000000                           THRU 0290-MONTA-DETALHE-USU-FIM.
000000
000000    GO TO PROCESSA-USU.
000000
000000 0200-IDENTIFICA-USU-FIM.
000000
000000 0210-MONTA-USU.
000000
000000      FIND USC-POR-USUARIO AT
000000         CLI-CODIGO = CLI-JANELA-WS AND
000000         USU-CODIGO = USU-CODIGO OF USU-REG
000000         ON EXCEPTION
000000             IF DMSTATUS(NOTFOUND)
000000                DISPLAY "Usuario nao possui MAC."
000000             ELSE
000000                CALL SYSTEM DMTERMINATE
000000             END-IF
000000      END-FIND.
000000
000000      IF UNO-CODIGO-ORI OF USUARIO-CLI NOT EQUAL ZEROS THEN
000000          MOVE UNO-CODIGO-ORI OF USUARIO-CLI
000000                              TO UNO-CODIGO OF USU-REG
000000      END-IF
000000
000000      IF UNO-CODIGO-FIS OF USUARIO-CLI NOT EQUAL ZEROS THEN
000000          MOVE UNO-CODIGO-FIS OF USUARIO-CLI
000000                              TO UNO-CODIGO-FIS OF USU-REG
000000      END-IF
000000
000000      IF UNO-CODIGO-SUB OF USUARIO-CLI NOT EQUAL ZEROS AND
000000          DATA-SISTEMAR >= USC-DATA-INI-SUBST OF USUARIO-CLI AND
000000          DATA-SISTEMAR <= USC-DATA-FIM-SUBST OF USUARIO-CLI THEN
000000              MOVE UNO-CODIGO-SUB OF USUARIO-CLI
000000                           TO UNO-CODIGO-SUB OF USU-REG
000000      END-IF.
000000
000000 0210-MONTA-USU-FIM.
000000
000000 0220-BUSCA-TIPO-LOTACAO.
000000
000000*PROCURA LOT-CODIGO ORI
000000  FIND UNL-POR-UNO AT
000000        CLI-CODIGO = CLI-JANELA-WS AND
000000        UNO-CODIGO = UNO-CODIGO-FIS OF USU-REG
000000        ON EXCEPTION
000000           IF NOT DMSTATUS (NOTFOUND) THEN
000000              CALL SYSTEM DMTERMINATE
000000           ELSE
000000              DISPLAY "Tipo de Lotacao nao cadastrada."
000000           END-IF
000000           GO TO 0220-BUSCA-TIPO-LOTACAO-FIM
000000   END-FIND.
000000
000000   MOVE LOT-CODIGO OF UNO-LOTACAO
000000     TO LOT-CODIGO OF USU-REG.
000000*PROCURA LOT-CODIGO ORI
000000
000000*PROCURA LOT-CODIGO FIS
000000      IF UNO-CODIGO-FIS OF USUARIO-CLI NOT EQUAL ZEROS THEN
000000          FIND UNL-POR-UNO AT
000000              CLI-CODIGO = CLI-JANELA-WS AND
000000              UNO-CODIGO = UNO-CODIGO-FIS OF USU-REG
000000          ON EXCEPTION
000000              IF NOT DMSTATUS (NOTFOUND) THEN
000000                 CALL SYSTEM DMTERMINATE
000000              ELSE
000000                  DISPLAY "Tipo de Lotacao nao cadastrada."
000000              END-IF
000000              GO TO 0220-BUSCA-TIPO-LOTACAO-FIM
000000          END-FIND
000000      END-IF.
000000
000000     MOVE LOT-CODIGO OF UNO-LOTACAO
000000          TO LOT-CODIGO-FIS OF USU-REG.
000000
000000*PROCURA LOT-CODIGO FIS
000000
000000*PROCURA LOT-CODIGO SUB
000000  FIND UNL-POR-UNO AT
000000        CLI-CODIGO = CLI-JANELA-WS AND
000000        UNO-CODIGO = UNO-CODIGO-FIS OF USU-REG
000000        ON EXCEPTION
000000           IF NOT DMSTATUS (NOTFOUND) THEN
000000              CALL SYSTEM DMTERMINATE
000000           ELSE
000000              DISPLAY "Tipo de Lotacao nao cadastrada."
000000           END-IF
000000           GO TO 0220-BUSCA-TIPO-LOTACAO-FIM
000000   END-FIND.
000000
000000   MOVE LOT-CODIGO OF UNO-LOTACAO
000000     TO LOT-CODIGO-SUB OF USU-REG.
000000
000000*PROCURA LOT-CODIGO SUB
000000
000000 0220-BUSCA-TIPO-LOTACAO-FIM.
000000 EXIT.
000000
000000 0230-BUSCA-TIF-CODIGO.
000000*buscar na funcionarios o fco codigo e procurar
000000*FUN-CLIENTE
000000*FUN-CODIGO A
000000   FIND FUN-POR-IDENT
000000      AT FUN-CLIENTE = CLI-JANELA-WS
000000      AND FUN-CODIGO = USU-CODIGO OF USU-REG
000000      ON EXCEPTION
000000        IF DMSTATUS(NOTFOUND)
000000        DISPLAY "EXIBIR MENSAGEM DE ERRO"
000000        ELSE
000000           CALL SYSTEM DMTERMINATE
000000   END-FIND.
000000
000000   IF FCO-CODIGO-ORI OF FUNCIONARIOS NOT EQUAL ZEROS
000000          MOVE FCO-CODIGO-ORI OF FUNCIONARIOS
000000                  TO FCO-COD-ORI-WS.
000000
000000   IF FCO-CODIGO-FIS OF FUNCIONARIOS NOT EQUAL ZEROS
000000          MOVE FCO-CODIGO-FIS OF FUNCIONARIOS
000000                  TO FCO-COD-FIS-WS.
000000
000000   IF FCO-CODIGO-SUB OF FUNCIONARIOS NOT EQUAL ZEROS
000000          MOVE FCO-CODIGO-SUB OF FUNCIONARIOS
000000                  TO FCO-COD-SUB-WS.
000000*BUSCA TIF-CODIGO ORI
000000   FIND FIRST FCO-POR-CODIGO AT
000000          CLI-CODIGO   =  CLI-JANELA-WS AND
000000          FCO-CODIGO   =  FCO-COD-ORI-WS
000000          ON EXCEPTION
000000             IF DMSTATUS (NOTFOUND)
000000                DISPLAY "Tipo de Funcao nao cadastrada."
000000                MOVE 1 TO RESULTADO-77
000000             ELSE
000000                CALL SYSTEM DMTERMINATE
000000             END-IF
000000             GO TO 0230-BUSCA-TIF-CODIGO-FIM
000000   END-FIND.
000000
000000   MOVE TIF-CODIGO OF FUNCAO
000000     TO TIF-CODIGO OF USU-REG.
000000*BUSCA TIF-CODIGO ORI
000000*BUSCA TIF-CODIGO FIS
000000   FIND FIRST FCO-POR-CODIGO AT
000000          CLI-CODIGO   =  CLI-JANELA-WS AND
000000          FCO-CODIGO   =  FCO-COD-ORI-WS
000000          ON EXCEPTION
000000             IF DMSTATUS (NOTFOUND)
000000                DISPLAY "Tipo de Funcao nao cadastrada."
000000                MOVE 1 TO RESULTADO-77
000000             ELSE
000000                CALL SYSTEM DMTERMINATE
000000             END-IF
000000             GO TO 0230-BUSCA-TIF-CODIGO-FIM
000000   END-FIND.
000000
000000   MOVE TIF-CODIGO OF FUNCAO
000000     TO TIF-CODIGO OF USU-REG.
000000*BUSCA TIF-CODIGO FIS
000000*BUSCA TIF-CODIGO SUB
000000   FIND FIRST FCO-POR-CODIGO AT
000000          CLI-CODIGO   =  CLI-JANELA-WS AND
000000          FCO-CODIGO   =  FCO-COD-ORI-WS
000000          ON EXCEPTION
000000             IF DMSTATUS (NOTFOUND)
000000                DISPLAY "Tipo de Funcao nao cadastrada."
000000                MOVE 1 TO RESULTADO-77
000000             ELSE
000000                CALL SYSTEM DMTERMINATE
000000             END-IF
000000             GO TO 0230-BUSCA-TIF-CODIGO-FIM
000000   END-FIND.
000000
000000   MOVE TIF-CODIGO OF FUNCAO
000000     TO TIF-CODIGO OF USU-REG.
000000*BUSCA TIF-CODIGO SUB
000000
000000 0230-BUSCA-TIF-CODIGO-FIM.
000000 EXIT.
000000
000000 0240-BUSCA-NIVEL-ACESSO.
000000
000000  FIND UCS-POR-USUARIO AT
000000        CFS-VER-SISEG = 0                AND
000000        USU-CLIENTE = CLI-JANELA-WS      AND
000000        USU-CODIGO = USU-CODIGO OF USU-REG
000000        ON EXCEPTION
000000           IF DMSTATUS(NOTFOUND)
000000              DISPLAY "Sem nivel de acesso"
000000           END-IF
000000  END-FIND.
000000
000000  MOVE UCS-FUNCAO OF USUARIOS-CLI-SIST TO
000000        USU-NVL-ACE OF USU-REG.
000000
000000 0240-BUSCAO-NIVEL-ACESSO-FIM.
000000
000000 0290-MONTA-USU-REG.
000000
000000      MOVE USU-CODIGO     OF USUARIO-CLI
000000                          TO USU-CODIGO OF USU-REG.
000000      MOVE USU-NOME       OF USUARIOS
000000                          TO USU-NOME   OF USU-REG.
000000      MOVE UNO-CODIGO-ORI OF USUARIO-CLI
000000                          TO UNO-CODIGO OF USU-REG.
000000      MOVE UNO-CODIGO-FIS OF USUARIO-CLI
000000                          TO UNO-CODIGO-FIS OF USU-REG.
000000      MOVE UNO-CODIGO-SUB OF USUARIO-CLI
000000                          TO UNO-CODIGO-SUB OF USU-REG.
000000
000000 WRITE USU-REG.
000000
000000 0290-MONTA-DETALHE-USU-FIM.
000000 EXIT.
000000
000000 0300-PROCESSA-GRUPOS.
000000 PROCURAR MATRIZ PELA LOTACAO
000000   SET MGR-POR-LOTAC TO BEGINNING.
000000
000000 0310-MONTA-COD-GRUPO.
000000   FIND KEY OF NEXT MGR-POR-LOTAC AT
000000        CLI-CODIGO = CLI-JANELA-WS AND
000000        LOT-CODIGO = LOT-CODIGO  OF USU-REG    AND
000000        TIF-CODIGO = TIF-CODIGO  OF USU-REG
000000        ON EXCEPTION
000000           IF NOT DMSTATUS(NOTFOUND)
000000              DISPLAY "MENSAGEM DE ERRO"
000000           ELSE
000000              DISPLAY "Usuario nao possui matriz de acesso."
000000           END-IF
000000   END-FIND.
000000
000000   MOVE GOP-CODIGO OF MATRIZ-GRUPO TO GOP-CODIGO-GRP OF ARQ-GRP.
000000   MOVE SIS-CODIGO OF MATRIZ-GRUPO TO SIS-CODIGO OF ARQ-GRP.
000000
000000 0310-MONTA-COD-GRUPO-FIM.
000000 EXIT.
000000
000000 0320-MONTA-NOME-SISTEMA.
000000  SET SIS-POR-CODIGO TO BEGINNING.
000000  MOVE SPACES TO SIS-NOME OF ARQ-GRP.
000000
000000 0330-BUSCA-SISTEMA.
000000  FIND NEXT SIS-POR-CODIGO AT
000000        SIS-CODIGO = SIS-CODIGO OF ARQ-GRP
000000         ON EXCEPTION
000000            IF DMSTATUS(NOTFOUND)
000000               DISPLAY "Sistema nao cadastrado."
000000            ELSE
000000               DISPLAY "MENSAGEM ERRO"
000000            END-IF
000000  END-FIND.
000000
000000  MOVE SIS-NOME OF SISTEMAS
000000    TO SIS-NOME OF ARQ-GRP.
000000
000000 0320-MONTA-NOME-SISTEMA-FIM.
000000 EXIT.
000000
000000 0330-MONTA-ABRANGENCIA.
000000
000000    FIND MAB-POR-LOT-TIF AT
000000          CLI-CODIGO   = CLI-JANELA-WS AND
000000          SIS-CODIGO   = SIS-CODIGO OF SISTEMAS    AND
000000          LOT-CODIGO   = LOT-CODIGO OF USU-REG     AND
000000          TIF-CODIGO   = TIF-CODIGO OF USU-REG
000000          ON EXCEPTION
000000             IF NOT DMSTATUS (NOTFOUND)
000000                 DISPLAY "MENSAGEM ERRO"
000000             END-IF
000000    END-FIND.
000000
000000    MOVE UCS-ABRANGENCIA OF MATRIZ-ABRANG
000000      TO UCS-ABRANGENCIA OF ARQ-GRP.
000000
000000    FIND FIRST TAG-POR-IDENT AT
000000         TAG-CLIENTE  =  CLI-JANELA-WS         AND
000000         TAG-SISTEMA  =  SIS-CODIGO OF ARQ-GRP AND
000000         TAG-CODIGO   =  UCS-ABRANGENCIA OF ARQ-GRP
000000          ON EXCEPTION
000000             IF DMSTATUS (NOTFOUND)
000000                DISPLAY "Codigo abrangencia nao cadastrado"
000000             ELSE
000000                DISPLAY "MENSAGEM ERRO"
000000             END-IF
000000    END-FIND.
000000
000000   MOVE TAG-DESCRICAO   OF TAB-ABRANGENCIA
000000     TO ABR-DESCRICAO   OF ARQ-GRP.
000000
000000 0330-MONTA-ABRANGENCIA-FIM.
000000  EXIT.
000000
000000 0300-PROCESSA-GRUPOS-FIM.
000000    EXIT.
000000
000000 0400-PROCESSA-PERFIL.
000000
000000   SET SIS-POR-CODIGO TO BEGINNING.
000000
000000 0401-MONTA-MATRIZ-PERFIL.
000000   FIND KEY OF NEXT MPE-POR-LOT-TIF AT
000000        CLI-CODIGO = CLI-JANELA-WS AND
000000        LOT-CODIGO = LOT-CODIGO  OF USU-REG    AND
000000        TIF-CODIGO = TIF-CODIGO  OF USU-REG
000000        ON EXCEPTION
000000           IF NOT DMSTATUS(NOTFOUND)
000000              DISPLAY "ERRO BANCO DE DADOS"
000000           END-IF
000000   END-FIND.
000000
000000   MOVE PER-CODIGO OF MATRIZ-PERFIL TO SIS-CODIGO-PER OF ARQ-PER.
000000   MOVE SIS-CODIGO OF MATRIZ-PERFIL TO SIS-CODIGO OF ARQ-PER.
000000
000000 0420-BUSCA-SISTEMA.
000000  FIND NEXT SIS-POR-CODIGO AT
000000        SIS-CODIGO = SIS-CODIGO OF ARQ-PER
000000         ON EXCEPTION
000000            IF DMSTATUS(NOTFOUND)
000000               DISPLAY "Sistema nao cadastrado."
000000                 ELSE
000000               DISPLAY "MENSAGEM ERRO"
000000            END-IF
000000  END-FIND.
000000
000000  MOVE SIS-NOME OF SISTEMAS
000000    TO SIS-NOME OF ARQ-PER.
000000
000000 0420-MONTA-NOME-SISTEMA-FIM.
000000 EXIT.
000000
000000 0400-PROCESSA-PERFIL-FIM.
000000 EXIT.
000000
000000 0500-ARQUIVO-GRUPOS.
000000
000000  SET GOP-POR-IDENT TO BEGINNING.
000000
000000  FIND FIRST GOP-POR-IDENT AT
000000         CFS-VER-SISEG = VERSAO-SEG-WS     AND
000000         GOP-CLIENTE   = CLI-JANELA-WS
000000         ON EXCEPTION
000000            IF DMSTATUS (NOTFOUND)
000000                 DISPLAY "Grupo nao identificado"
000000                 GO TO 0500-ARQUIVO-GRUPOS-FIM
000000            END-IF
000000   END-FIND.
000000
000000
000000  MOVE GOP-CLIENTE OF GRUPOS-OPERACOES
000000                    TO CLI-JANELA OF ARQ-DESC-GRP.
000000  MOVE GOP-CODIGO OF GRUPOS-OPERACOES
000000                    TO SIS-CODIGO-GRP OF ARQ-DESC-GRP.
000000  MOVE GOP-MNEMONICO OF GRUPOS-OPERACOES
000000                       TO GOP-MNEMONICO OF ARQ-DESC-GRP.
000000  MOVE GOP-DESCRICAO OF GRUPOS-OPERACOES
000000                       TO GOP-DESCRICAO OF ARQ-DESC-GRP.
000000
000000  GO TO NEXT-GRUPO.
000000
000000 NEXT-GRUPO.
000000
000000  FIND FIRST GOP-POR-IDENT AT
000000         CFS-VER-SISEG = VERSAO-SEG-WS     AND
000000         GOP-CLIENTE   = CLI-JANELA-WS
000000         ON EXCEPTION
000000            IF DMSTATUS (NOTFOUND)
000000            IF DMSTATUS (NOTFOUND)
000000                 DISPLAY "Grupo nao identificado"
000000                 GO TO 0500-ARQUIVO-GRUPOS-FIM
000000            END-IF
000000   END-FIND.
000000
000000  MOVE GOP-CLIENTE OF GRUPOS-OPERACOES
000000                    TO CLI-JANELA OF ARQ-DESC-GRP.
000000  MOVE GOP-CODIGO OF GRUPOS-OPERACOES
000000                    TO SIS-CODIGO-GRP OF ARQ-DESC-GRP.
000000  MOVE GOP-MNEMONICO OF GRUPOS-OPERACOES
000000                       TO GOP-MNEMONICO OF ARQ-DESC-GRP.
000000  MOVE GOP-DESCRICAO OF GRUPOS-OPERACOES
000000                       TO GOP-DESCRICAO OF ARQ-DESC-GRP.
000000
000000 0500-ARQUIVO-GRUPOS-FIM.
000000 EXIT.
000000
000000 0600-ARQUIVO-PERFIL.
000000
000000     SET PER-POR-IDENT TO BEGINNING.
000000     SET MPE-POR-LOT-TIF TO BEGINNING.
000000
000000     FIND FIRST MPE-POR-LOT-TIF AT
000000         CLI-CODIGO = CLI-JANELA-WS
000000         ON EXCEPTION
000000           IF DMSTATUS (NOTFOUND)
000000              DISPLAY "Nenhum perfil encontrado"
000000              GO TO 0600-ARQUIVO-PERFIL-FIM
000000           END-IF
000000     END-FIND.
000000
000000     MOVE SIS-CODIGO OF MATRIZ-PERFIL TO SIS-CODIGO-WS.
000000     MOVE PER-CODIGO OF MATRIZ-PERFIL TO PER-CODIGO-WS.
000000
000000     FIND FIRST PER-POR-IDENT AT
000000         SIS-CODIGO = SIS-CODIGO-WS AND
000000         PER-CODIGO = PER-CODIGO-WS
000000         ON EXCEPTION
000000            IF DMSTATUS (NOTFOUND)
000000              DISPLAY "Nenhum perfil encontrado"
000000              GO TO 0600-ARQUIVO-PERFIL-FIM
000000            END-IF
000000    END-FIND.
000000
000000    MOVE CLI-JANELA-WS TO CLI-JANELA OF ARQ-DESC-PER.
000000    MOVE PER-CODIGO OF PERFIL TO SIS-CODIGO-PER OF ARQ-DESC-PER.
000000    MOVE PER-DESCRICAO OF PERFIL
000000                          TO PER-DESCRICAO OF ARQ-DESC-PER.
000000
000000    GO TO NEXT-PERFIL.
000000
000000 NEXT-PERFIL.
000000
000000    FIND FIRST MPE-POR-LOT-TIF AT
000000         CLI-CODIGO = CLI-JANELA-WS
000000         ON EXCEPTION
000000           IF DMSTATUS (NOTFOUND)
000000              DISPLAY "Nenhum perfil encontrado"
000000              GO TO 0600-ARQUIVO-PERFIL-FIM
000000           END-IF
000000    END-FIND.
000000
000000    MOVE SIS-CODIGO OF MATRIZ-PERFIL TO SIS-CODIGO-WS.
000000    MOVE PER-CODIGO OF MATRIZ-PERFIL TO PER-CODIGO-WS.
000000
000000    FIND FIRST PER-POR-IDENT AT
000000         SIS-CODIGO = SIS-CODIGO-WS AND
000000         PER-CODIGO = PER-CODIGO-WS
000000        ON EXCEPTION
000000            IF DMSTATUS (NOTFOUND)
000000               DISPLAY "Nenhum perfil encontrado"
000000               GO TO 0600-ARQUIVO-PERFIL-FIM
000000            END-IF
000000    END-FIND.
000000
000000    MOVE CLI-JANELA-WS TO CLI-JANELA OF ARQ-DESC-PER.
000000    MOVE PER-CODIGO OF PERFIL TO SIS-CODIGO-PER OF ARQ-DESC-PER.
000000    MOVE PER-DESCRICAO OF PERFIL
000000                          TO PER-DESCRICAO OF ARQ-DESC-PER.
000000
000000 0600-ARQUIVO-PERFIL-FIM.
000000 EXIT.
000000
000000 99900-00-ULTIMO-PARAGRAFO.
000000     CLOSE BDSEGURANCA.
000000     STOP RUN.
000000
000000 END-OF-JOB.
000000